
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.игсЗаявкаНаОплату");  
	
	ПараметрыРегистрации.Назначение = МассивНазначений;
	ПараметрыРегистрации.Наименование = "Выгрузка вложенных файлов из учетных систем"; 
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Информация = "Обработка добавляет кнопку на форму списка и документа ""Заявка на оплату"".
	|Открываемая форма выгрузки данных позволяет загружать файлы из смежных систем в Присоединенные файлы Заявки. 
	|Автор: <ИГС> ПР Потылицын Г.С. #0065, 18.12.2025";
	
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Загрузить вложенные файлы из учетных систем", "ЗагрузитьФайлыИзСистем", "ОткрытиеФормы", Ложь);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")   
	
	НоваяКоманда 						= ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление 			= Представление; 
	НоваяКоманда.Идентификатор 			= Идентификатор;
	НоваяКоманда.Использование 			= Использование;
	НоваяКоманда.ПоказыватьОповещение 	= ПоказыватьОповещение;
	НоваяКоманда.Модификатор 			= Модификатор;
	
КонецПроцедуры
