
// Обновить Документы

&НаКлиенте
Процедура ОбновитьСтатусыДокументов(Команда)
	
	ОбновитьСтатусыДокументовСервер();		
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыДокументовСервер()
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ОбновитьСтатусыДокументов();
	
КонецПроцедуры

// Загрузить Документы

&НаКлиенте
Процедура ЗагрузитьСопроводительныеДокументы(Команда)
	
	ЗагрузитьСопроводительныеДокументыСервер();
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьСопроводительныеДокументыСервер() 
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ОбновитьСтатусыДокументов();
	
КонецПроцедуры
