
Функция СведенияОВнешнейОбработке() Экспорт     
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru = 'Предназначен для анализа информации по доходам и расходам предприятия в разрезе проектов и скважин.'");
	ПараметрыРегистрации.Наименование 		= НСтр("ru = 'Затраты на проекты от контрагентов'");	
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 			= "1.1";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru = 'Затраты на проекты от контрагентов'");
	Команда.Идентификатор 					= "ЗатратыНаПроектыОтКонтрагентов";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Ложь;
	Команда.Модификатор 					= "ПечатьMXL";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	
	Для Каждого СтрокаНастроек Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(СтрокаНастроек) = Тип("ЭлементОтбораКомпоновкиДанных") И СтрокаНастроек.Использование Тогда
			Если ТипЗнч(СтрокаНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда 
				Контрагент = СтрокаНастроек.ПравоеЗначение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПериодИндекс			= ПолучитьИндексПараметра(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы, "Период");
	ОрганизацияИндекс		= ПолучитьИндексПараметра(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы, "Организация");
	
	НачалоПериода			= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[ПериодИндекс].Значение.ДатаНачала;
	КонецПериода			= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[ПериодИндекс].Значение.ДатаОкончания;
	Организация				= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[ОрганизацияИндекс].Значение;
	
	Запрос 					= Новый Запрос;
	Запрос.Текст 			= игсОборотныйДляБДР.ТекстЗапроса();
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("СписокСвертки", );
	
	ВидРезерваУбыточныхПроектов = ПланыВидовХарактеристик.игсНастройкиМеханизмов.ВидРезерваУбыточныхПроектов;
	
	СтруктураПараметров = игсОборотныйДляБДР.КонстантныеПараметры();
	
	Запрос.УстановитьПараметр("СубконтоДт", 					СтруктураПараметров.СубконтоДт);
	Запрос.УстановитьПараметр("СубконтоДтОбщ", 					СтруктураПараметров.СубконтоДтОбщ);
	Запрос.УстановитьПараметр("СубконтоПрочиеДоходыРасходы", 	СтруктураПараметров.СубконтоПрочиеДоходыРасходы);
	Запрос.УстановитьПараметр("Субконто4642", 					СтруктураПараметров.Субконто4642);
	Запрос.УстановитьПараметр("Субконто9001", 					СтруктураПараметров.Субконто9001);
	Запрос.УстановитьПараметр("Счет4662", 						СтруктураПараметров.Счет4662);
	Запрос.УстановитьПараметр("СчетаЗатрат", 					СтруктураПараметров.СчетаЗатрат);
	Запрос.УстановитьПараметр("ВидРезерваУбыточныхПроектов", 	ВидРезерваУбыточныхПроектов);
	Запрос.УстановитьПараметр("Счет10", 						СтруктураПараметров.Счет10);
	Запрос.УстановитьПараметр("Счет20", 						СтруктураПараметров.Счет20);
	Запрос.УстановитьПараметр("Счет23", 						СтруктураПараметров.Счет23);
	Запрос.УстановитьПараметр("Счет25", 						СтруктураПараметров.Счет25);
	Запрос.УстановитьПараметр("Счет26", 						СтруктураПараметров.Счет26);
	Запрос.УстановитьПараметр("Счет29", 						СтруктураПараметров.Счет29);
	Запрос.УстановитьПараметр("Счет90", 						СтруктураПараметров.Счет90);
	Запрос.УстановитьПараметр("Счет96", 						СтруктураПараметров.Счет96);
	Запрос.УстановитьПараметр("Счет0201", 						СтруктураПараметров.Счет0201);
	Запрос.УстановитьПараметр("Счет7101", 						СтруктураПараметров.Счет7101);
	Запрос.УстановитьПараметр("Счет9101", 						СтруктураПараметров.Счет9101);
	Запрос.УстановитьПараметр("Счет9102", 						СтруктураПараметров.Счет9102);
	Запрос.УстановитьПараметр("Счет9609", 						СтруктураПараметров.Счет9609);
	Запрос.УстановитьПараметр("НДС10",							СтруктураПараметров.НДС10);
	Запрос.УстановитьПараметр("НДС18", 							СтруктураПараметров.НДС18);
	Запрос.УстановитьПараметр("НДС20", 							СтруктураПараметров.НДС20);
	
	РезультатЗапроса 		= Запрос.Выполнить();
	ЗатратыНаПроекты 		= РезультатЗапроса.Выгрузить();
	
	СхемаКомпоновкиДанных 	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	
	ДанныеРасшифровки 		= Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных; 
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[ПериодИндекс].Значение.ДатаНачала 	= НачалоПериода; 
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[ПериодИндекс].Значение.ДатаОкончания = КонецПериода;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[ОрганизацияИндекс].Значение 			= Организация;
	
	Для Каждого СтрокаОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Контрагент <> Неопределено Тогда
			СтрокаОтбора.ПравоеЗначение = Контрагент;
		Иначе 
			СтрокаОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ЗатратыНаПроекты", ЗатратыНаПроекты);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ПолучитьИндексПараметра(КоллекцияЭлементов, ИмяПараметра)
	
	Индекс = 0;
	
	Для Каждого Элемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если Строка(Элемент.Параметр) = ИмяПараметра Тогда
			Возврат Индекс;
		КонецЕсли;
		
		Индекс = Индекс + 1; 
		
	КонецЦикла;
	
	Возврат -1;
	
КонецФункции
