&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	
	Объект.СсылкаНаОбъект = ОбъектыНазначения[0];
	ПолучитьДанныеИсходногоДокумента(); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Заполнение возможно только при выбранной организации.'");
		Возврат;
	КонецЕсли;
	
	Если Объект.ТаблицаЗаполнена  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,0)
	Иначе
		Инициализировать();
	КонецЕсли;  
	
	ВладелецФормы.Прочитать(); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИсходногоДокумента()  
	
	ИсходныйОбъект 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СсылкаНаОбъект,"игсСклад, Организация,ОС,ДокументОснованиеДата",Истина);
	Объект.Склад  			= ИсходныйОбъект.игсСклад;
	Объект.Период 			= ИсходныйОбъект.ДокументОснованиеДата;
	Объект.Организация 		= ИсходныйОбъект.Организация; 
	
	Объект.ТаблицаЗаполнена = ИсходныйОбъект.Ос.Пустой() > 0          
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Инициализировать();
	КонецЕсли; 
	
	ВладелецФормы.Прочитать(); 
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать() Экспорт 
	
	ЗапросОС = Новый Запрос;
	ЗапросОС.Текст = 
	"ВЫБРАТЬ
		|	игсАрендованныеОСОстатки.ОсновноеСредство КАК ОС,
		|	игсАрендованныеОСОстатки.Склад КАК Склад,
		|	игсАрендованныеОСОстатки.Контрагент КАК Контрагент,
		|	игсАрендованныеОСОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.игсАрендованныеОС.Остатки(&Периодданных, ) КАК игсАрендованныеОСОстатки
		|ГДЕ
		|	(игсАрендованныеОСОстатки.Склад = &Склад
		|			ИЛИ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
		|	И (игсАрендованныеОСОстатки.Организация = &Организация
		|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организация.ПустаяСсылка))
		|	И игсАрендованныеОСОстатки.СуммаОстаток > 0" ;  
	
	ЗапросОС.УстановитьПараметр("Склад",		Объект.Склад);
	ЗапросОС.УстановитьПараметр("Организация",	Объект.Организация);
	ЗапросОС.УстановитьПараметр("Периодданных",	Объект.Период); 
	
	РезультатЗапроса = ЗапросОС.Выполнить(); 
	
	Если РезультатЗапроса <> Неопределено Тогда 
		
		ЦелевойОбъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();
		ЦелевойОбъект.ОС.Очистить();
		
		ОСДляЗаполнения = РезультатЗапроса.Выгрузить();
		
		Если ОСДляЗаполнения.Количество() > 0 Тогда  
			
			Для Каждого ОС Из ОСДляЗаполнения Цикл 
				
				НоваяСтрока 							= ЦелевойОбъект.ОС.Добавить();
				НоваяСтрока.ОсновноеСредство 			= Ос.Ос;
				НоваяСтрока.КоличествоПоДаннымУчета 	= 1;
				НоваяСтрока.КоличествоФактическое 		= 1;
				НоваяСтрока.НаличиеФактическое  		= Истина;
				НоваяСтрока.НаличиеПоДаннымУчета 		= истина;
				НоваяСтрока.СтоимостьПоДаннымУчета 		= ОС.СуммаОстаток; 
				
			КонецЦикла;  
			
		КонецЕсли;   
		
		ЦелевойОбъект.Записать(); 
		
	КонецЕсли;	
	
КонецПроцедуры

