Функция СведенияОВнешнейОбработке() Экспорт     
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.игсРеестрыНаОплату"); //Указываем документ к которому делаем внешнюю печ. форму
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "РеестрПлатежейСГруппировкойПоСтатусуОплаты"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", ""); 
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Сличительная ведомость буровых и комплектующих", "СличительнаяВедомостьБуровыхИКомплектующих", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды; 
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Функция Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	СсылкаНаОбъект = МассивОбъектов[0];
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СличительнаяВедомостьБуровыхИКомплектующих";
	НомерСтраницы   = 2;
	ТабДокумент = ПечатьМакетаРеестраНаОплату(СсылкаНаОбъект,	ОбъектыПечати, ПараметрыВывода);
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СличительнаяВедомостьБуровыхИКомплектующих","Сличительная ведомость буровых и комплектующих",ТабДокумент);
КонецФункции      


Функция ПечатьМакетаРеестраНаОплату(СсылкаНаОбъект,	ОбъектыПечати, ПараметрыВывода)
	МакетДляПечати = ПолучитьМакет("МакетОтчета");
	ДокументРезультат = Новый ТабличныйДокумент;
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	игсРеестрыНаОплатуСводныеОстатки.РасчетныйСчет КАК РасчетныйСчет,
	               |	игсРеестрыНаОплатуСводныеОстатки.КоличествоДокументов КАК КоличествоДокументов,
	               |	игсРеестрыНаОплатуСводныеОстатки.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	               |	игсРеестрыНаОплатуСводныеОстатки.СуммаПриход КАК СуммаПриход,
	               |	игсРеестрыНаОплатуСводныеОстатки.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	               |	игсРеестрыНаОплатуСводныеОстатки.СуммаРасход КАК СуммаРасход
	               |ПОМЕСТИТЬ ВТ_БанковскиеСчетаОрганизации
	               |ИЗ
	               |	Документ.игсРеестрыНаОплату.СводныеОстатки КАК игсРеестрыНаОплатуСводныеОстатки
	               |ГДЕ
	               |	игсРеестрыНаОплатуСводныеОстатки.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БанковскиеСчетаОрганизации.РасчетныйСчет КАК РасчетныйСчет,
	               |	ВТ_БанковскиеСчетаОрганизации.КоличествоДокументов КАК КоличествоДокументов,
	               |	ВТ_БанковскиеСчетаОрганизации.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	               |	ВТ_БанковскиеСчетаОрганизации.СуммаПриход КАК СуммаПриход,
	               |	ВТ_БанковскиеСчетаОрганизации.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	               |	ВТ_БанковскиеСчетаОрганизации.СуммаРасход КАК СуммаРасход,
	               |	БанковскиеСчета.Валютный КАК Валютный,
	               |	БанковскиеСчета.ВалютаДенежныхСредств КАК Валюта
	               |ИЗ
	               |	ВТ_БанковскиеСчетаОрганизации КАК ВТ_БанковскиеСчетаОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ПО ВТ_БанковскиеСчетаОрганизации.РасчетныйСчет = БанковскиеСчета.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	игсРеестрыНаОплатуЗаявкиНаОплату.Ссылка КАК Заявка,
	               |	ПоступлениеТоваровУслугУслуги.игсОбъектРаспределения КАК игсОбъектРаспределения,
	               |	ВЫБОР
	               |		КОГДА игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги)
	               |			ТОГДА ВЫБОР
	               |					КОГДА игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента.ДокументОснование.СчетУчетаРасчетовСКонтрагентом <> &Счет2001
	               |						ТОГДА ""Неопределено""
	               |					ИНАЧЕ """"
	               |				КОНЕЦ
	               |		ИНАЧЕ ""Неопределено""
	               |	КОНЕЦ КАК СтатусОплаты,
	               |	игсЗаявкаНаОплатуДокументыРасчетов.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	               |	игсРеестрыНаОплатуЗаявкиНаОплату.СуммаКОплате КАК СуммаКОплате,
	               |	игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента.ДокументОснование КАК СсылкаДокументаДокументОснование,
	               |	игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента.ДокументОснование.ВидОперации КАК СсылкаДокументаДокументОснованиеВидОперации,
	               |	игсКазнаРегистрСостоянийСрезПоследних.СостояниеЗаявки КАК Статус
	               |ПОМЕСТИТЬ ВТ_ЗаявкиИСчетаНаОплату
	               |ИЗ
	               |	РегистрСведений.игсКазнаРегистрСостояний.СрезПоследних(&ДатаОтчета, ) КАК игсКазнаРегистрСостоянийСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.игсРеестрыНаОплату.ЗаявкиНаОплату КАК игсРеестрыНаОплатуЗаявкиНаОплату
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.игсЗаявкаНаОплату.ДокументыРасчетов КАК игсЗаявкаНаОплатуДокументыРасчетов
	               |			ПО игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента = игсЗаявкаНаОплатуДокументыРасчетов.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |			ПО игсРеестрыНаОплатуЗаявкиНаОплату.СсылкаДокумента.ДокументОснование = ПоступлениеТоваровУслугУслуги.Ссылка
	               |		ПО игсКазнаРегистрСостоянийСрезПоследних.Заявка = игсРеестрыНаОплатуЗаявкиНаОплату.Ссылка
	               |ГДЕ
	               |	игсРеестрыНаОплатуЗаявкиНаОплату.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_ЗаявкиИСчетаНаОплату.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	               |	игсНачальныеОстаткиОплаченныхЭтаповРабот.Организация КАК Организация,
	               |	игсНачальныеОстаткиОплаченныхЭтаповРабот.Этап КАК Этап,
	               |	Вт_ЗаявкиИСчетаНаОплату.СуммаКОплате КАК СуммаКОплате,
	               |	""Оплачено"" КАК СтатусОплаты
	               |ПОМЕСТИТЬ ВТ_ОплаченныеЭтапыРабот
	               |ИЗ
	               |	ВТ_ЗаявкиИСчетаНаОплату КАК Вт_ЗаявкиИСчетаНаОплату
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.игсНачальныеОстаткиОплаченныхЭтаповРабот КАК игсНачальныеОстаткиОплаченныхЭтаповРабот
	               |		ПО Вт_ЗаявкиИСчетаНаОплату.игсОбъектРаспределения = игсНачальныеОстаткиОплаченныхЭтаповРабот.Этап
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_ЗаявкиИСчетаНаОплату.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	               |	Вт_ЗаявкиИСчетаНаОплату.СуммаКОплате КАК СуммаКОплате,
	               |	"""" КАК СтатусОплаты,
	               |	Вт_ЗаявкиИСчетаНаОплату.игсОбъектРаспределения КАК НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ВТ_НоменклатурныеГруппыДляПроверки
	               |ИЗ
	               |	ВТ_ЗаявкиИСчетаНаОплату КАК Вт_ЗаявкиИСчетаНаОплату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.игсНачальныеОстаткиОплаченныхЭтаповРабот КАК игсНачальныеОстаткиОплаченныхЭтаповРабот
	               |		ПО Вт_ЗаявкиИСчетаНаОплату.игсОбъектРаспределения = игсНачальныеОстаткиОплаченныхЭтаповРабот.Этап
	               |ГДЕ
	               |	игсНачальныеОстаткиОплаченныхЭтаповРабот.Этап ЕСТЬ NULL
	               |	И Вт_ЗаявкиИСчетаНаОплату.СтатусОплаты <> ""Неопределено""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НоменклатурныеГруппыДляПроверки.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	               |	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК ДокументРасчетов,
	               |	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ВТ_НГДР
	               |ИЗ
	               |	ВТ_НоменклатурныеГруппыДляПроверки КАК ВТ_НоменклатурныеГруппыДляПроверки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, &ДатаОтчета, Запись, СчетДт В ИЕРАРХИИ (&Счет62), &СубконтоРасчетныеДок, СчетКт В ИЕРАРХИИ (&Счет46), &СубконтоНоменклатурныеГруппы, ) КАК ХозрасчетныйОборотыДтКт
	               |		ПО (ХозрасчетныйОборотыДтКт.СубконтоКт1 = ВТ_НоменклатурныеГруппыДляПроверки.НоменклатурнаяГруппа)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НГДР.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	               |	ВЫБОР
	               |		КОГДА ХозрасчетныйОборотыДтКт.СуммаОборот > 0
	               |			ТОГДА ""Оплачено""
	               |		ИНАЧЕ ""Неопределено""
	               |	КОНЕЦ КАК СтатусОплаты,
	               |	ВТ_НГДР.ДокументРасчетов КАК ДокументРасчетов,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма
	               |ПОМЕСТИТЬ ВТ_ЗаявкиПоКоторымПроизведенаОплата
	               |ИЗ
	               |	ВТ_НГДР КАК ВТ_НГДР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, &ДатаОтчета, Запись, СчетДт В ИЕРАРХИИ (&Счета51_52), &Субконто51_52, СчетКт В ИЕРАРХИИ (&Счет62), &СубконтоРасчетныеДок, ) КАК ХозрасчетныйОборотыДтКт
	               |		ПО ВТ_НГДР.ДокументРасчетов = ХозрасчетныйОборотыДтКт.СубконтоКт1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиПоКоторымПроизведенаОплата.ДокументРасчетовСКонтрагентом КАК Заявка,
	               |	ВТ_ЗаявкиПоКоторымПроизведенаОплата.СтатусОплаты КАК Статус,
	               |	ВТ_ЗаявкиПоКоторымПроизведенаОплата.Сумма КАК СуммаЗаяв
	               |ИЗ
	               |	ВТ_ЗаявкиПоКоторымПроизведенаОплата КАК ВТ_ЗаявкиПоКоторымПроизведенаОплата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОплаченныеЭтапыРабот.ДокументРасчетовСКонтрагентом,
	               |	ВТ_ОплаченныеЭтапыРабот.СтатусОплаты,
	               |	ВТ_ОплаченныеЭтапыРабот.СуммаКОплате
	               |ИЗ
	               |	ВТ_ОплаченныеЭтапыРабот КАК ВТ_ОплаченныеЭтапыРабот
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ЗаявкиИСчетаНаОплату.ДокументРасчетовСКонтрагентом,
	               |	""Неопределено"",
	               |	ВТ_ЗаявкиИСчетаНаОплату.СуммаКОплате
	               |ИЗ
	               |	ВТ_ЗаявкиИСчетаНаОплату КАК ВТ_ЗаявкиИСчетаНаОплату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОплаченныеЭтапыРабот КАК ВТ_ОплаченныеЭтапыРабот
	               |		ПО ВТ_ЗаявкиИСчетаНаОплату.ДокументРасчетовСКонтрагентом = ВТ_ОплаченныеЭтапыРабот.ДокументРасчетовСКонтрагентом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаявкиПоКоторымПроизведенаОплата КАК ВТ_ЗаявкиПоКоторымПроизведенаОплата
	               |		ПО ВТ_ЗаявкиИСчетаНаОплату.ДокументРасчетовСКонтрагентом = ВТ_ЗаявкиПоКоторымПроизведенаОплата.ДокументРасчетовСКонтрагентом
	               |ГДЕ
	               |	ВТ_ЗаявкиПоКоторымПроизведенаОплата.ДокументРасчетовСКонтрагентом ЕСТЬ NULL
	               |	И ВТ_ОплаченныеЭтапыРабот.ДокументРасчетовСКонтрагентом ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_БанковскиеСчетаОрганизации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ЗаявкиИСчетаНаОплату
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ОплаченныеЭтапыРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НоменклатурныеГруппыДляПроверки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_НГДР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ЗаявкиПоКоторымПроизведенаОплата";
	СубконтоНГ = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
	СубконтоСчета   = Новый Массив;
	СубконтоСчета.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета);
	СубконтоСчета.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);//оно же 51_52
    СубконтоРасчетныеДокументы = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами;
	Счет2001 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство_;
	Счет46 = ПланыСчетов.Хозрасчетный.ВыполненныеЭтапыПоНезавершеннымРаботам;
	счета51_52 = новый Массив;
	счета51_52.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	счета51_52.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
	Счет62 = ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками;
	ДанныеРеестранаОплату = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект,"Организация, Дата",Истина); 

	Запрос.УстановитьПараметр("Владелец",ДанныеРеестранаОплату.Организация);
	Запрос.УстановитьПараметр("СубконтоНоменклатурныеГруппы",СубконтоНГ);
	Запрос.УстановитьПараметр("ДатаОтчета",ДанныеРеестранаОплату.Дата);
	Запрос.УстановитьПараметр("Счет2001",Счет2001);
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СубконтоСчета",СубконтоСчета);
	Запрос.УстановитьПараметр("Счет46",Счет46);
	Запрос.УстановитьПараметр("Субконто51_52",СубконтоСчета);
	запрос.УстановитьПараметр("Счета51_52",счета51_52);
	Запрос.УстановитьПараметр("СубконтоРасчетныеДок", СубконтоРасчетныеДокументы);
	Запрос.УстановитьПараметр("Счет62",Счет62);
	Результат = Запрос.ВыполнитьПакет();
	ДанныеРеестранаОплату.Дата = Формат(ДанныеРеестранаОплату.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка = МакетДляПечати.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = ДанныеРеестранаОплату.Дата;
	ОбластьШапка.Параметры.Организация = ДанныеРеестранаОплату.организация;
	ДокументРезультат.Вывести(ОбластьШапка);
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешнийНаборДанных = Новый Структура;
	
	Если не Результат[1].Пустой() тогда
		СчетаОрганизации = Результат[1].Выгрузить();
		ВнешнийНаборДанных.Вставить("Счета", СчетаОрганизации);		
	КонецЕсли;
	Если Не Результат[7].Пустой() тогда
		ДанныеПоЗаявкам = Результат[7].Выгрузить(); 
		ВнешнийНаборДанных.Вставить("ЗаявкиИСтатусыОплат", ДанныеПоЗаявкам);		

	КонецЕсли;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	областьПодвал = МакетДляПечати.ПолучитьОбласть("Подвал");
	областьПодвал.Параметры.Период = ДанныеРеестранаОплату.Дата;
	ДокументРезультат.Вывести(ОбластьПодвал);
    Возврат ДокументРезультат
КонецФункции