  
  Функция СведенияОВнешнейОбработке() Экспорт
	  
	  ИмяОтчета = ЭтотОбъект.Метаданные().Имя;
	  Синоним 	= ЭтотОбъект.Метаданные().Синоним;
	  Синоним 	= ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОтчета);
	  
	  РегистрационныеДанные = Новый Структура;
	  РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	  РегистрационныеДанные.Вставить("Наименование", Синоним);
	  РегистрационныеДанные.Вставить("Версия", "1.1");
	  РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	  РегистрационныеДанные.Вставить("Информация", "Отчет " + Синоним);
	  
	  ТаблицаКоманд = ПолучитьТаблицуКоманд();
	  
	  ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет", "ОткрытиеФормы", Истина);
	  
	  РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
	  
	  Возврат РегистрационныеДанные;
	  
  КонецФункции
  
  Функция ПолучитьТаблицуКоманд()
	  
	  Команды = Новый ТаблицаЗначений;
	  Команды.Колонки.Добавить("Представление", 			Новый ОписаниеТипов("Строка"));
	  Команды.Колонки.Добавить("Идентификатор", 			Новый ОписаниеТипов("Строка"));
	  Команды.Колонки.Добавить("Использование", 			Новый ОписаниеТипов("Строка"));
	  Команды.Колонки.Добавить("ПоказыватьОповещение", 		Новый ОписаниеТипов("Булево"));
	  Команды.Колонки.Добавить("Модификатор", 				Новый ОписаниеТипов("Строка"));
	  
	  Возврат Команды;
	  
  КонецФункции
  
  Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
	  
	  НоваяКоманда 							= ТаблицаКоманд.Добавить();
	  НоваяКоманда.Представление 			= Представление;
	  НоваяКоманда.Идентификатор 			= Идентификатор;
	  НоваяКоманда.Использование 			= Использование;
	  НоваяКоманда.ПоказыватьОповещение 	= ПоказыватьОповещение;
	  НоваяКоманда.Модификатор 				= Модификатор; 
	  
  КонецПроцедуры
  
  Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	  
	  СтандартнаяОбработка = Ложь;
	  
	  СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	  
	  НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 
	  
	  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(НачалоПериода));
	  НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	  
	  ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиОтчета.Отбор, "Контрагент", Контрагент, , , Истина);
	  ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиОтчета.Отбор, "ДоговорКонтрагента", ДоговорКонтрагента, , , Истина);
	  
	  КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	  МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	  
	  ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	  ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	  
	  ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	  ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	  ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	  
  КонецПроцедуры
