&НаСервере
Функция ПечатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");  
	
	Возврат  ДокументОбъект.Печать(ОбъектыНазначения, Новый ТаблицаЗначений, Новый СписокЗначений, Новый Структура); 
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) 
	
	Результат = ПечатьнаСервере();
	Результат.Показать();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Назначение Из Параметры.ОбъектыНазначения Цикл  
		
		ОбъектыНазначения.Добавить(Назначение); 
		
	КонецЦикла; 
	
КонецПроцедуры

