
Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= "Заполнение арендованных ОС";
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия 			= "1.2";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	ПараметрыРегистрации.Назначение.Добавить("Документ.игсУчетЗабалансовыхОС");
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= "Заполнение арендованных ОС";
	Команда.Идентификатор 					= "ЗаполнениеАрендованныхОС";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Истина;
	
	Возврат  ПараметрыРегистрации;  
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения, ПараметрыВыполнения) Экспорт

	Если ИдентификаторКоманды = "ЗаполнениеАрендованныхОС" Тогда 
		
		Форма = ПолучитьФорму("ФормаНастройки");
		Форма.Открыть(ОбъектыНазначения);
		
	КонецЕсли;
	
	
КонецПроцедуры

