
Функция СведенияОВнешнейОбработке() Экспорт     
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru = 'Заполнение инвентаризации товаров на складе по МЦ'");
	ПараметрыРегистрации.Наименование 		= НСтр("ru = 'Заполнение товаров по МЦ'");
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия 			= "1.3";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	ПараметрыРегистрации.Назначение.Добавить("Документ.ИнвентаризацияТоваровНаСкладе");
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru = 'Заполнение товаров по МЦ'");
	Команда.Идентификатор 					= "ЗаполнитьТоварыПоМЦ"; 
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции      

