 
 Функция СведенияОВнешнейОбработке() Экспорт 
	 
	 ПараметрыРегистрации = Новый Структура;
	 ПараметрыРегистрации.Вставить("Вид","ПечатнаяФорма");
	 ПараметрыРегистрации.Вставить("Назначение",ПолучитьНазначениеОбработки());
	 ПараметрыРегистрации.Вставить("Версия","1.0");
	 ПараметрыРегистрации.Вставить("Наименование","КС-3");  
	 ПараметрыРегистрации.Вставить("Информация","КС-3");
	 ПараметрыРегистрации.Вставить("БезопасныйРежим",Ложь);
	 
	 Команды = ПолучитьТаблицуКоманд();
	 
	 ДобавитьКоманду(Команды,"КС-3", "КС3", "ВызовСерверногоМетода", Ложь, "ПечатьMXL");
	 
	 ПараметрыРегистрации.Вставить("Команды",Команды);
	 Возврат ПараметрыРегистрации;
	 
 КонецФункции
 
 Функция ПолучитьТаблицуКоманд() 
	 
	 Команды = Новый ТаблицаЗначений;
	 
	 Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	 Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	 
	 Возврат Команды;
	 
 КонецФункции 
 
 Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	 НоваяКоманда = ТаблицаКоманд.Добавить();
	 НоваяКоманда.Представление = Представление;
	 НоваяКоманда.Идентификатор = Идентификатор;
	 НоваяКоманда.Использование = Использование;
	 НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	 НоваяКоманда.Модификатор = Модификатор;
 КонецПроцедуры  
 
 Функция ПолучитьНазначениеОбработки()
	 
	 Массив = Новый Массив;
	 Массив.Добавить("Документ.ИмпРеализацияСтроительныхРаботУслуг");  
	 Возврат Массив; 
	 
 КонецФункции        
 
 Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	 
	 ПараметрыПечати = Новый Структура;
	 
	 УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	 КоллекцияПечатныхФорм, 
	 "КС3", "КС-3", ПечатьОбъекта(МассивОбъектов));
	 
 КонецПроцедуры
 
 Функция ПечатьОбъекта(МассивОбъектов) Экспорт 
	 
	 ФормироватьВРуб=Истина;
	 
	 Запрос = Новый Запрос;
	 Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	 Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	РеализацияСтроительныхРаботУслуг.Номер КАК Номер,
	 |	РеализацияСтроительныхРаботУслуг.Дата КАК Дата,
	 |	РеализацияСтроительныхРаботУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	 |	РеализацияСтроительныхРаботУслуг.Контрагент КАК Контрагент,
	 |	РеализацияСтроительныхРаботУслуг.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	 |	РеализацияСтроительныхРаботУслуг.Организация КАК Организация,
	 |	РеализацияСтроительныхРаботУслуг.Инвестор КАК Инвестор,
	 |	РеализацияСтроительныхРаботУслуг.ВалютаДокумента КАК ВалютаДокумента,
	 |	РеализацияСтроительныхРаботУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	 |	РеализацияСтроительныхРаботУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	 |	РеализацияСтроительныхРаботУслуг.ДатаНачала КАК ДатаНачала,
	 |	РеализацияСтроительныхРаботУслуг.ДатаОкончания КАК ДатаОкончания,
	 |	РеализацияСтроительныхРаботУслуг.ПодписьПодрядчик КАК ПодписьПодрядчик,
	 |	РеализацияСтроительныхРаботУслуг.ПодписьЗаказчик КАК ПодписьЗаказчик,
	 |	РеализацияСтроительныхРаботУслуг.УчитыватьНДС КАК УчитыватьНДС,
	 |	РеализацияСтроительныхРаботУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	 |	РеализацияСтроительныхРаботУслуг.Инвестор.КодПоОКПО КАК ИнвесторКодПоОКПО,
	 |	РеализацияСтроительныхРаботУслуг.Контрагент.КодПоОКПО КАК КонтрагентКодПоОКПО,
	 |	РеализацияСтроительныхРаботУслуг.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
	 |	РеализацияСтроительныхРаботУслуг.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.Стройка.НаименованиеПолное КАК СтройкаНаименованиеПолное,
	 |	РеализацияСтроительныхРаботУслуг.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.Стройка.АдресСтроительства КАК СтройкаАдресСтроительства,
	 |	РеализацияСтроительныхРаботУслуг.ДоговорКонтрагента.Номер КАК НомерДоговора,
	 |	РеализацияСтроительныхРаботУслуг.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	 |	РеализацияСтроительныхРаботУслуг.СуммаДокумента КАК СуммаДокумента,
	 |	РеализацияСтроительныхРаботУслуг.ВидОперации КАК ВидОперации,
	 |	РеализацияСтроительныхРаботУслуг.Ссылка КАК Ссылка,
	 |	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК ТекущаяДолжность
	 |ПОМЕСТИТЬ Документ
	 |ИЗ
	 |	Документ.ИмпРеализацияСтроительныхРаботУслуг КАК РеализацияСтроительныхРаботУслуг
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	 |		ПО РеализацияСтроительныхРаботУслуг.ПодписьПодрядчик = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
	 |			И РеализацияСтроительныхРаботУслуг.Организация = ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация
	 |ГДЕ
	 |	РеализацияСтроительныхРаботУслуг.Ссылка В(&Ссылка)";
	 Результат = Запрос.Выполнить();
	 
	 Шапка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("Документ").ПолучитьДанные().Выбрать();
	 Шапка.Следующий(); 
	 
	 Запрос.УстановитьПараметр("НачалоГода", 		  НачалоГода(Шапка.Дата));
	 Запрос.УстановитьПараметр("НачалоПериода", 	  Шапка.ДатаНачала);
	 Запрос.УстановитьПараметр("КонецПериода", 		  КонецДня(Шапка.ДатаОкончания)); 
	 
	 КонецПериодаОборотов = КонецДня(Шапка.Дата);
	 
	 Запрос.УстановитьПараметр("КонецПериодаОборотов",	Новый Граница(КонецПериодаОборотов, ВидГраницы.Включая));					
	 
	 МассивСубконто = Новый Массив;
	 МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	 Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	 
	 МассивКорСубконто = Новый Массив;
	 МассивКорСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	 МассивКорСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	 Запрос.УстановитьПараметр("КорСубконто", МассивКорСубконто);
	 
	 Запрос.Текст ="ВЫБРАТЬ
	               |	СУММА(ХозрасчетныйОборотыДтКт.СуммаНУОборотКт) КАК СуммаСНачалаРабот,
	               |	СУММА(ВЫБОР
	               |			КОГДА ХозрасчетныйОборотыДтКт.Период >= &НачалоГода
	               |				ТОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотКт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаСНачалаГода,
	               |	СУММА(ВЫБОР
	               |			КОГДА ХозрасчетныйОборотыДтКт.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |				ТОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотКт
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаЗапериод,
	               |	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТСуммы
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, &КонецПериодаОборотов, Регистратор, , &КорСубконто, СчетКТ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Выручка)), &Субконто, ) КАК ХозрасчетныйОборотыДтКт
	               |ГДЕ
	               |	ВЫРАЗИТЬ(ХозрасчетныйОборотыДтКт.Регистратор КАК Документ.ИмпРеализацияСтроительныхРаботУслуг).ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ИмпВидыОперацийРеализацияСтроительныхРаботУслуг.УслугиГенподрядчика)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОборотыДтКт.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА Услуги.Номенклатура.НаименованиеПолное <> """"
	               |			ТОГДА Услуги.Номенклатура.НаименованиеПолное
	               |		ИНАЧЕ Услуги.Номенклатура.Наименование
	               |	КОНЕЦ КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА Услуги.Ссылка.СуммаВключаетНДС
	               |			ТОГДА Услуги.Сумма - Услуги.СуммаНДС
	               |		ИНАЧЕ Услуги.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	Услуги.СуммаНДС КАК СуммаНДС,
	               |	Услуги.Ссылка КАК ДокументРеализацияСтроительныхРабот,
	               |	Услуги.НомерИДатаАкта КАК НомерИДатаАкта,
	               |	Документ.Номер КАК Номер,
	               |	Документ.Дата КАК Дата,
	               |	Документ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Документ.Контрагент КАК Контрагент,
	               |	Документ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	Документ.Организация КАК Организация,
	               |	Документ.Инвестор КАК Инвестор,
	               |	Документ.ВалютаДокумента КАК ВалютаДокумента,
	               |	Документ.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	Документ.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	Документ.ДатаНачала КАК ДатаНачала,
	               |	Документ.ДатаОкончания КАК ДатаОкончания,
	               |	Документ.ПодписьПодрядчик КАК ПодписьПодрядчик,
	               |	Документ.ПодписьЗаказчик КАК ПодписьЗаказчик,
	               |	Документ.УчитыватьНДС КАК УчитыватьНДС,
	               |	Документ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	Документ.ИнвесторКодПоОКПО КАК ИнвесторКодПоОКПО,
	               |	Документ.КонтрагентКодПоОКПО КАК КонтрагентКодПоОКПО,
	               |	Документ.ОрганизацияКодПоОКПО КАК ОрганизацияКодПоОКПО,
	               |	Документ.СтройкаНаименованиеПолное КАК СтройкаНаименованиеПолное,
	               |	Документ.СтройкаАдресСтроительства КАК СтройкаАдресСтроительства,
	               |	Документ.НомерДоговора КАК НомерДоговора,
	               |	Документ.ДатаДоговора КАК ДатаДоговора,
	               |	Документ.СуммаДокумента КАК СуммаДокумента,
	               |	Документ.ВидОперации КАК ВидОперации,
	               |	ВТСуммы.СуммаСНачалаРабот КАК СуммаСНачалаРабот,
	               |	ВТСуммы.СуммаСНачалаГода КАК СуммаСНачалаГода,
	               |	ВТСуммы.СуммаЗапериод КАК СуммаЗапериод,
	               |	Документ.ТекущаяДолжность КАК ТекущаяДолжность
	               |ИЗ
	               |	Документ.ИмпРеализацияСтроительныхРаботУслуг.Услуги КАК Услуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммы КАК ВТСуммы
	               |		ПО Услуги.Ссылка = ВТСуммы.Регистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ КАК Документ
	               |		ПО Услуги.Ссылка = Документ.Ссылка
	               |ГДЕ
	               |	Услуги.Ссылка В(&Ссылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СубподрядныеРаботы.Номенклатура.НаименованиеПолное <> """"
	               |			ТОГДА СубподрядныеРаботы.Номенклатура.НаименованиеПолное
	               |		ИНАЧЕ СубподрядныеРаботы.Номенклатура.Наименование
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА СубподрядныеРаботы.Ссылка.СуммаВключаетНДС
	               |			ТОГДА СубподрядныеРаботы.Сумма - СубподрядныеРаботы.СуммаНДС
	               |		ИНАЧЕ СубподрядныеРаботы.Сумма
	               |	КОНЕЦ,
	               |	СубподрядныеРаботы.СуммаНДС,
	               |	СубподрядныеРаботы.Ссылка,
	               |	СубподрядныеРаботы.НомерИДатаАкта,
	               |	Документ.Номер,
	               |	Документ.Дата,
	               |	Документ.ДоговорКонтрагента,
	               |	Документ.Контрагент,
	               |	Документ.НоменклатурнаяГруппа,
	               |	Документ.Организация,
	               |	Документ.Инвестор,
	               |	Документ.ВалютаДокумента,
	               |	Документ.КратностьВзаиморасчетов,
	               |	Документ.КурсВзаиморасчетов,
	               |	Документ.ДатаНачала,
	               |	Документ.ДатаОкончания,
	               |	Документ.ПодписьПодрядчик,
	               |	Документ.ПодписьЗаказчик,
	               |	Документ.УчитыватьНДС,
	               |	Документ.СуммаВключаетНДС,
	               |	Документ.ИнвесторКодПоОКПО,
	               |	Документ.КонтрагентКодПоОКПО,
	               |	Документ.ОрганизацияКодПоОКПО,
	               |	Документ.СтройкаНаименованиеПолное,
	               |	Документ.СтройкаАдресСтроительства,
	               |	Документ.НомерДоговора,
	               |	Документ.ДатаДоговора,
	               |	Документ.СуммаДокумента,
	               |	Документ.ВидОперации,
	               |	ВТСуммы.СуммаСНачалаРабот,
	               |	ВТСуммы.СуммаСНачалаГода,
	               |	ВТСуммы.СуммаЗапериод,
	               |	NULL
	               |ИЗ
	               |	Документ.ИмпРеализацияСтроительныхРаботУслуг.СубподрядныеРаботы КАК СубподрядныеРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммы КАК ВТСуммы
	               |		ПО СубподрядныеРаботы.Ссылка = ВТСуммы.Регистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ КАК Документ
	               |		ПО СубподрядныеРаботы.Ссылка = Документ.Ссылка
	               |ГДЕ
	               |	СубподрядныеРаботы.Ссылка В(&Ссылка)";
	 
	 
	 ТабДокумент = Новый ТабличныйДокумент;	
	 
	 ТабДокумент.АвтоМасштаб = Истина;
	 
	 Если ФормироватьВРуб Тогда
		 ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КС3Руб";		
	 Иначе		
		 ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КС3";
	 КонецЕсли;
	 
	 Макет = ПолучитьМакет("КС3");
	 
	 Результат = Запрос.Выполнить();
	 
	 Если Результат.Пустой() Тогда
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Во время формирования запроса произошла ошибка");
		 Возврат ТабДокумент;
	 КонецЕсли;
	 
	 ВыборкаПолная = Результат.Выгрузить();
	 Выборка = ВыборкаПолная.Скопировать();
	 Выборка.Колонки.Удалить("Номенклатура");
	 Выборка.Свернуть("ДокументРеализацияСтроительныхРабот,ТекущаяДолжность, СтройкаНаименованиеПолное, ОрганизацияКодПоОКПО, Организация, КонтрагентКодПоОКПО,СтройкаАдресСтроительства, ИнвесторКодПоОКПО,Дата, Номер, Контрагент, ДОговорКонтрагента, Инвестор, НоменклатурнаяГруппа, НомерДоговора, ДатаДоговора, ВалютаДокумента, ДатаНачала, ДатаОкончания, ПодписьПодрядчик, ПодписьЗаказчик, ВидОперации, УчитыватьНДС, СуммаВключаетНДС",
	 "СуммаСНачалаРабот, СуммаСНАчалаГода, СуммаЗаПериод, Сумма, СуммаНДС");
	 	 
	Для каждого ВыборкаНоменклатура Из Выборка Цикл		 
		 		 
		 ИтогиПоДокументу = Новый Структура("Сумма, СуммаНДС");
		 ЗаполнитьЗначенияСвойств(ИтогиПоДокументу, ВыборкаНоменклатура);
		 
		 мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
		 
		 Если Не ФормироватьВРуб Тогда		
			 
			 СуммаСНачалаРабот = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(ВыборкаНоменклатура.СуммаСНачалаРабот, 	ВыборкаНоменклатура.ВалютаДокумента, мВалютаРегламентированногоУчета, ВыборкаНоменклатура.КурсВзаиморасчетов, 1, ВыборкаНоменклатура.КратностьВзаиморасчетов,1);
			 СуммаСНачалаГода  = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(ВыборкаНоменклатура.СуммаСНачалаГода, 	ВыборкаНоменклатура.ВалютаДокумента, мВалютаРегламентированногоУчета, ВыборкаНоменклатура.КурсВзаиморасчетов, 1, ВыборкаНоменклатура.КратностьВзаиморасчетов,1);
			 СуммаЗаПериод     = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(ВыборкаНоменклатура.СуммаЗаПериод, 		ВыборкаНоменклатура.ВалютаДокумента, мВалютаРегламентированногоУчета, ВыборкаНоменклатура.КурсВзаиморасчетов, 1, ВыборкаНоменклатура.КратностьВзаиморасчетов,1);		
			 
			 НДСРуб	 = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(ИтогиПоДокументу.СуммаНДС, ВыборкаНоменклатура.ВалютаДокумента, мВалютаРегламентированногоУчета, ВыборкаНоменклатура.КурсВзаиморасчетов, 1, ВыборкаНоменклатура.КратностьВзаиморасчетов,1);
			 СуммаРуб = РаботаСКурсамиВалютБПКлиентСервер.ПересчитатьИзВалютыВВалюту(ИтогиПоДокументу.Сумма, 	 ВыборкаНоменклатура.ВалютаДокумента, мВалютаРегламентированногоУчета, ВыборкаНоменклатура.КурсВзаиморасчетов, 1, ВыборкаНоменклатура.КратностьВзаиморасчетов,1);
			 
		 Иначе
			 СуммаСНачалаРабот = ВыборкаНоменклатура.СуммаСНачалаРабот;
			 СуммаСНачалаГода  = ВыборкаНоменклатура.СуммаСНачалаГода;
			 СуммаЗаПериод     = ВыборкаНоменклатура.СуммаЗаПериод;                     
			 
			 СуммаРуб = ИтогиПоДокументу.Сумма;
			 НДСРуб   = ИтогиПоДокументу.СуммаНДС
		 КонецЕсли;
		 
		 ИтогоРуб = СуммаРуб + НДСРуб;		
		 
		 // Шапка
		 Область = Макет.ПолучитьОбласть("Шапка");
		 Область.Параметры.ДатаДок               = Формат(ВыборкаНоменклатура.Дата, "ДФ=dd.MM.yyyy");
		 
		 Область.Параметры.ДатаС                 = Формат(НачалоМесяца(ВыборкаНоменклатура.Дата), "ДФ=dd.MM.yyyy");
		 Область.Параметры.ДатаДо                = Формат(КонецМесяца(ВыборкаНоменклатура.Дата), "ДФ=dd.MM.yyyy");
		 Область.Параметры.Стройка               = МассивОбъектов[0].игсПроект;
		 Область.Параметры.НомерДок              = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаНоменклатура.Номер, Истина, Ложь);
		 
		 СведенияОбИнвесторе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ВыборкаНоменклатура.Инвестор, ВыборкаНоменклатура.Дата);
		 Область.Параметры.Инвестор	 		    = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбИнвесторе, "ПолноеНаименование,ЮридическийАдрес,Телефоны,Факс");
		 Область.Параметры.ИнвесторОКПО			= ВыборкаНоменклатура.ИнвесторКодПоОКПО;
		 Область.Параметры.Заказчик	 		    = "Заказчик (генподрядчик):"+ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата),"ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		 Область.Параметры.ЗаказчикОКПО			= ВыборкаНоменклатура.КонтрагентКодПоОКПО;
		 Область.Параметры.Подрядчик			= "Подрядчик (субподрядчик):"+ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата),"ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		 Область.Параметры.ПодрядчикОКПО		= ВыборкаНоменклатура.ОрганизацияКодПоОКПО;
		 Область.Параметры.Стройка   			= "Стройка: " + ВыборкаНоменклатура.СтройкаНаименованиеПолное + ", " + ВыборкаНоменклатура.СтройкаАдресСтроительства;
		 
		 Если ВыборкаНоменклатура.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.НаименованиеПолное <> "" Тогда
			 ОбъектСтроительства = ВыборкаНоменклатура.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.НаименованиеПолное
		 ИначеЕсли ВыборкаНоменклатура.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.Наименование <> "" Тогда
			 ОбъектСтроительства = ВыборкаНоменклатура.НоменклатурнаяГруппа.ХарактеристикиОбъектаСтроительства.Наименование
		 Иначе	
			 ОбъектСтроительства = ВыборкаНоменклатура.НоменклатурнаяГруппа
			 
		 КонецЕсли;
		 Область.Параметры.Стройка			  	= ОбъектСтроительства;
		 
		 Область.Параметры.НомерДок				= ВыборкаНоменклатура.Номер;
		 Область.Параметры.ДатаДок				= Формат(ВыборкаНоменклатура.Дата,  "ДФ=dd. MM.yyyy");
		 
		 Область.Параметры.Договор				= ВыборкаНоменклатура.НомерДоговора;
		 Область.Параметры.ДатаДоговора			= Формат(ВыборкаНоменклатура.ДатаДоговора,  "ДФ=dd.MM.yyyy");
		 Область.Параметры.ВидОперации			= ВыборкаНоменклатура.ВидОперации;
		 
		 ТабДокумент.Вывести(Область);
		 ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаб");
		 ТабДокумент.Вывести(ОбластьЗаголовок);
		 
		 НоменклатураДокумента = ВыборкаПолная.НайтиСтроки(Новый Структура("ДокументРеализацияСтроительныхРабот", ВыборкаНоменклатура.ДокументРеализацияСтроительныхРабот));
		 Для каждого Строка ИЗ НоменклатураДокумента Цикл
			 
			 ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
			 НомПП = 0;			 
			 
			 НомПП = НомПП + 1;
			 ОбластьСтрока.Параметры.НомерСтроки 		= НомПП;
			 ОбластьСтрока.Параметры.ТоварНаименование 	= Строка.Номенклатура;
			 ОбластьСтрока.Параметры.Сумма	 			= Строка.Сумма;
			 
			 ОбластьСтрока.Параметры.СНачалаГода 	= Строка.СуммаСНачалаГода;
			 ОбластьСтрока.Параметры.СНачалаМесяца 	= Строка.СуммаЗаПериод;
			 
			 ТабДокумент.Вывести(ОбластьСтрока);
			 
		 КонецЦикла;
		 
		 ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
		 
		 ОбластьПодвал.Параметры.Сумма = СуммаРуб;
		 ОбластьПодвал.Параметры.ИтогоНДС 	= НДСРуб;
		 ОбластьПодвал.Параметры.ИтогоСумма = ИтогоРуб;
		 
		 ДанныеФизЛицаСдал = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(ВыборкаНоменклатура.Организация, ВыборкаНоменклатура.ПодписьПодрядчик, ВыборкаНоменклатура.Дата);	
		 
		 ОбластьПодвал.Параметры.ПодрядчикДолжность = ВыборкаНоменклатура.ТекущаяДолжность;
		 ОбластьПодвал.Параметры.ПодрядчикФИО		= ДанныеФизЛицаСдал.Представление;	
		 ОбластьПодвал.Параметры.ЗаказчикДолжность  = ВыборкаНоменклатура.Контрагент.ОсновноеКонтактноеЛицо.Должность;
		 ОбластьПодвал.Параметры.ЗаказчикФИО		= ВыборкаНоменклатура.Контрагент.ОсновноеКонтактноеЛицо;	
		 
		 ТабДокумент.Вывести(ОбластьПодвал);
		 ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЦикла; 
	 
	 
	 Возврат ТабДокумент;
	 
 КонецФункции 
 