&наКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	Объект.СсылкаНаОбъект = ОбъектыНазначения[0];
	ДанныеДиалога = данныеДляДиалога();
	Если НЕ ЗначениеЗаполнено(ДанныеДиалога.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Заполнение возможно только при выбранной организации.'");
		Возврат;
	КонецЕсли;

	Если  ДанныеДиалога.ЧислоСтрок > 0  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,0)
	Иначе
		Инициализировать();
	КонецЕсли;
    ВладелецФормы.Прочитать();
КонецПроцедуры




&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры



&НаСервере
Функция данныеДляДиалога()
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СсылкаНаОбъект,"Организация,ОС",Истина,);
	ДанныеДляВозврата = Новый Структура;
	ДанныеДляВозврата.Вставить("Организация", данные.Организация);
	ДанныеДляВозврата.Вставить("ЧислоСтрок", данные.Ос.Выгрузить().Количество());	
	Возврат ДанныеДляВозврата;
КонецФункции



&НаСервере
Процедура Инициализировать() Экспорт	
	целевойобъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИГС_ОстаткиОсновныхСредствОстатки.Субконто1 КАК ОсновноеСредство,
	|	ИГС_ОстаткиОсновныхСредствОстатки.Субконто2 КАК Склад,
	|	ИГС_ОстаткиОсновныхСредствОстатки.КоличествоОстаток КАК Количество,
	|	ИСТИНА КАК НаличиеПоДаннымУчета,
	|	ИГС_ОстаткиОсновныхСредствОстатки.СуммаОстатокДт КАК СтоимостьПоДаннымУчета
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОстатков,
	|			Счет = &СчетМЦ08,
	|			,
	|			Организация = &Организация
	|				И Субконто2 = &Склад) КАК ИГС_ОстаткиОсновныхСредствОстатки
	|ГДЕ
	|	ИГС_ОстаткиОсновныхСредствОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", 		Новый Граница(КонецДня(Объект.СсылкаНаОбъект.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 		Объект.СсылкаНаОбъект.Организация);
	Запрос.УстановитьПараметр("Склад", 				Объект.СсылкаНаОбъект.игсСклад);
	Запрос.УстановитьПараметр("СчетМЦ08",			ПланыСчетов.Хозрасчетный.НайтиПоКоду("МЦ.08",));
		Результат = Запрос.Выполнить().Выгрузить();
	ЦелевойОбъект.Ос.Очистить();
	для Каждого ОсновноеСредство из результат Цикл
		НоваяСтрока = ЦелевойОбъект.Ос.Добавить();
		НоваяСтрока.ОсновноеСредство = ОсновноеСредство.ОсновноеСредство;
		НоваяСтрока.СтоимостьПоДаннымУчета = ОсновноеСредство.СтоимостьПоДаннымУчета;
		НоваяСтрока.НаличиеПоДаннымУчета = Истина;
		НоваяСтрока.КоличествоПоДаннымУчета = 1;
		НоваяСтрока.НаличиеФактическое = Истина;
		НоваяСтрока.КоличествоФактическое = 1;
		НоваяСтрока.СтоимостьПоРезультатамИнвентаризации = ОсновноеСредство.СтоимостьПОДаннымУчета;
		НоваяСтрока.СтоимостьПоУчетуЗаЕдиницу = ОсновноеСредство.СтоимостьПОДаннымУчета;
	КонецЦикла;
	целевойобъект.Записать();	
    Возврат 

	
КонецПроцедуры