
Функция СведенияОВнешнейОбработке() Экспорт  
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru ='Заполнение арендованных ОС'");
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Версия 			= "1.2";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	ПараметрыРегистрации.Назначение.Добавить("Документ.ИзменениеСостоянияОС");
	ПараметрыРегистрации.Назначение.Добавить("Документ.ПеремещениеОС");
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru ='Заполнить остатками ОС по складу'");
	Команда.Идентификатор 					= "ЗаполнениеТЧОСПоОстаткамОсНаСкладах";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовКлиентскогоМетода();
	Команда.ПоказыватьОповещение 			= Истина;
	
	Возврат  ПараметрыРегистрации; 
	
КонецФункции


