Функция СведенияОВнешнейОбработке() Экспорт

	ИмяОтчета = ЭтотОбъект.Метаданные().Имя;
	Синоним = ЭтотОбъект.Метаданные().Синоним;
	Синоним = ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОтчета);
	
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет"); 
	ПараметрыРегистрации.Вставить("Наименование", Синоним);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Отчет" + Синоним);  
	
	Команды = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(Команды, "Детализация распределения по справкам (Внешний отчет)",
									Синоним,
									"СформироватьОтчет",
									Ложь,
									"ОткрытиеФормы");
	
КонецФункции   

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений; 
	
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));  
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры















