
&НаКлиенте
Процедура СнятьГалочки(Команда)
	
	Для Каждого Строка Из Объект.Этапы Цикл
		
		Строка.Выбор = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГалочки(Команда)
	
	Для Каждого Строка Из Объект.Этапы Цикл
		
		Строка.Выбор = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	
	Объект.Этапы.Очистить();

	ПутьКWebСервисуERPБюджетирование = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПредопределенноеЗначение("ПланВидовХарактеристик.игсНастройкиМеханизмов.ПутьКWebСервисуERPБюджетирование"), ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	
	Определения 		= Новый WSОпределения(ПутьКWebСервисуERPБюджетирование, "wsFiles", "wsP@ssw0rd1809");
	
	Прокси 		 		= Новый WSПрокси(Определения, "http://127.0.0.1", "IGS", "IGSSoap");       
	Прокси.Пользователь = "wsFiles";
	Прокси.Пароль 		= "wsP@ssw0rd1809";

	ТабРезультатСтрокой = Прокси.ПолучитьЭтапы();
	ТабРезультат = ЗначениеИзСтрокиВнутр(ТабРезультатСтрокой);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	ТаблицаРезультат.Колонки.Добавить("Сценарий", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("Проект", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("Месторождение", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("Куст", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("Скважина", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("Этап", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("ВидРабот", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ТаблицаРезультат.Колонки.Добавить("ГУИДЭтапа", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Для Каждого Строка Из ТабРезультат Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	ТабРезультат.Сортировать("Проект ВОЗР, Месторождение ВОЗР, Куст ВОЗР, Скважина ВОЗР, Этап ВОЗР, ВидРабот ВОЗР");
	
	МассивГУИДЭтапов = Новый Массив;
	
	Для каждого текСтрока Из ТабРезультат Цикл
	
		Нстр = Объект.Этапы.Добавить();
		Нстр.Выбор = Истина;
		
		Нстр.Сценарий      = текСтрока.Сценарий;
		Нстр.Проект        = текСтрока.Проект; 
		Нстр.Месторождение = текСтрока.Месторождение;
		Нстр.Куст          = текСтрока.Куст;
		Нстр.Скважина      = текСтрока.Скважина;
		Нстр.Этап          = текСтрока.Этап;
		Нстр.ВидРабот      = текСтрока.ВидРабот;
		
		Нстр.ИмяФайла      = текСтрока.ГУИДЭтапа;
		
		ОпределитьПроект(Нстр);
		ОпределитьМесторождение(Нстр);
		ОпределитьКуст(Нстр);
		ОпределитьСкважина(Нстр);
		ОпределитьЭтап(Нстр);
		ОпределитьВидРабот(Нстр);
		
		Нстр.ПроектРедактируется = Нстр.ПроектЭтоСтрока;
		Нстр.МесторождениеРедактируется = Нстр.МесторождениеЭтоСтрока;
		Нстр.КустРедактируется = Нстр.КустЭтоСтрока;
		Нстр.СкважинаРедактируется = Нстр.СкважинаЭтоСтрока;
		Нстр.ЭтапРедактируется = Нстр.ЭтапЭтоСтрока;
		Нстр.ВидРаботРедактируется = Нстр.ВидРаботЭтоСтрока;
		
		Если Не ТипЗнч(Нстр.Этап) = Тип("Строка") Тогда
			МассивГУИДЭтапов.Добавить(текСтрока.ГУИДЭтапа);	
			Объект.Этапы.Удалить(НСтр);
		КонецЕсли;
	
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ВТ_ERP.Сценарий КАК Сценарий,
	//		|	ВТ_ERP.Проект КАК Проект,
	//		|	ВТ_ERP.Месторождение КАК Месторождение,
	//		|	ВТ_ERP.Куст КАК Куст,
	//		|	ВТ_ERP.Скважина КАК Скважина,
	//		|	ВТ_ERP.Этап КАК Этап,
	//		|	ВТ_ERP.ВидРабот КАК ВидРабот,
	//		|	ВТ_ERP.ГУИДЭтапа КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_ERP
	//		|ИЗ
	//		|	&ВТ_ERP КАК ВТ_ERP
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_ERP.Сценарий КАК Сценарий,
	//		|	ВЫБОР
	//		|		КОГДА НГ_Проект.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_ERP.Проект
	//		|		ИНАЧЕ НГ_Проект.Ссылка
	//		|	КОНЕЦ КАК Проект,
	//		|	ВТ_ERP.Месторождение КАК Месторождение,
	//		|	ВТ_ERP.Куст КАК Куст,
	//		|	ВТ_ERP.Скважина КАК Скважина,
	//		|	ВТ_ERP.Этап КАК Этап,
	//		|	ВТ_ERP.ВидРабот КАК ВидРабот,
	//		|	ВТ_ERP.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_ПРОЕКТ
	//		|ИЗ
	//		|	ВТ_ERP КАК ВТ_ERP
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НГ_Проект
	//		|		ПО ВТ_ERP.Проект = НГ_Проект.Наименование
	//		|			И (&ПапкаПРОЕКТЫ = НГ_Проект.Родитель)
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_ERP
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_ПРОЕКТ.Сценарий КАК Сценарий,
	//		|	ВТ_ПРОЕКТ.Проект КАК Проект,
	//		|	ВЫБОР
	//		|		КОГДА НГ_Месторождение.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_ПРОЕКТ.Месторождение
	//		|		ИНАЧЕ НГ_Месторождение.Ссылка
	//		|	КОНЕЦ КАК Месторождение,
	//		|	ВТ_ПРОЕКТ.Куст КАК Куст,
	//		|	ВТ_ПРОЕКТ.Скважина КАК Скважина,
	//		|	ВТ_ПРОЕКТ.Этап КАК Этап,
	//		|	ВТ_ПРОЕКТ.ВидРабот КАК ВидРабот,
	//		|	ВТ_ПРОЕКТ.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_МЕСТОРОЖДЕНИЕ
	//		|ИЗ
	//		|	ВТ_ПРОЕКТ КАК ВТ_ПРОЕКТ
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НГ_Месторождение
	//		|		ПО ВТ_ПРОЕКТ.Месторождение = НГ_Месторождение.Наименование
	//		|			И ВТ_ПРОЕКТ.Проект = НГ_Месторождение.Родитель
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_ПРОЕКТ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.Сценарий КАК Сценарий,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.Проект КАК Проект,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.Месторождение КАК Месторождение,
	//		|	ВЫБОР
	//		|		КОГДА НГ_Куст.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_МЕСТОРОЖДЕНИЕ.Куст
	//		|		ИНАЧЕ НГ_Куст.Ссылка
	//		|	КОНЕЦ КАК Куст,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.Скважина КАК Скважина,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.Этап КАК Этап,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.ВидРабот КАК ВидРабот,
	//		|	ВТ_МЕСТОРОЖДЕНИЕ.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_КУСТ
	//		|ИЗ
	//		|	ВТ_МЕСТОРОЖДЕНИЕ КАК ВТ_МЕСТОРОЖДЕНИЕ
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НГ_Куст
	//		|		ПО ВТ_МЕСТОРОЖДЕНИЕ.Куст = НГ_Куст.Наименование
	//		|			И ВТ_МЕСТОРОЖДЕНИЕ.Месторождение = НГ_Куст.Родитель
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_МЕСТОРОЖДЕНИЕ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_КУСТ.Сценарий КАК Сценарий,
	//		|	ВТ_КУСТ.Проект КАК Проект,
	//		|	ВТ_КУСТ.Месторождение КАК Месторождение,
	//		|	ВТ_КУСТ.Куст КАК Куст,
	//		|	ВЫБОР
	//		|		КОГДА НГ_Скважина.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_КУСТ.Скважина
	//		|		ИНАЧЕ НГ_Скважина.Ссылка
	//		|	КОНЕЦ КАК Скважина,
	//		|	ВТ_КУСТ.Этап КАК Этап,
	//		|	ВТ_КУСТ.ВидРабот КАК ВидРабот,
	//		|	ВТ_КУСТ.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_СКВАЖИНА
	//		|ИЗ
	//		|	ВТ_КУСТ КАК ВТ_КУСТ
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НГ_Скважина
	//		|		ПО ВТ_КУСТ.Скважина = НГ_Скважина.Наименование
	//		|			И ВТ_КУСТ.Куст = НГ_Скважина.Родитель
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_КУСТ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_СКВАЖИНА.Сценарий КАК Сценарий,
	//		|	ВТ_СКВАЖИНА.Проект КАК Проект,
	//		|	ВТ_СКВАЖИНА.Месторождение КАК Месторождение,
	//		|	ВТ_СКВАЖИНА.Куст КАК Куст,
	//		|	ВТ_СКВАЖИНА.Скважина КАК Скважина,
	//		|	ВЫБОР
	//		|		КОГДА НГ_Этап.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_СКВАЖИНА.Этап
	//		|		ИНАЧЕ НГ_Этап.Ссылка
	//		|	КОНЕЦ КАК Этап,
	//		|	ВТ_СКВАЖИНА.ВидРабот КАК ВидРабот,
	//		|	ВТ_СКВАЖИНА.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_ЭТАП
	//		|ИЗ
	//		|	ВТ_СКВАЖИНА КАК ВТ_СКВАЖИНА
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НГ_Этап
	//		|		ПО ВТ_СКВАЖИНА.Этап = НГ_Этап.Наименование
	//		|			И ВТ_СКВАЖИНА.Скважина = НГ_Этап.Родитель
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_СКВАЖИНА
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_ЭТАП.Сценарий КАК Сценарий,
	//		|	ВТ_ЭТАП.Проект КАК Проект,
	//		|	ВТ_ЭТАП.Месторождение КАК Месторождение,
	//		|	ВТ_ЭТАП.Куст КАК Куст,
	//		|	ВТ_ЭТАП.Скважина КАК Скважина,
	//		|	ВТ_ЭТАП.Этап КАК Этап,
	//		|	ВЫБОР
	//		|		КОГДА игсВидыРабот.Ссылка ЕСТЬ NULL
	//		|			ТОГДА ВТ_ЭТАП.ВидРабот
	//		|		ИНАЧЕ игсВидыРабот.Ссылка
	//		|	КОНЕЦ КАК ВидРабот,
	//		|	ВТ_ЭТАП.ИмяФайла КАК ИмяФайла
	//		|ПОМЕСТИТЬ ВТ_ВИДРАБОТ
	//		|ИЗ
	//		|	ВТ_ЭТАП КАК ВТ_ЭТАП
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.игсВидыРабот КАК игсВидыРабот
	//		|		ПО ВТ_ЭТАП.ВидРабот = игсВидыРабот.Наименование
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_ЭТАП
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТ_ВИДРАБОТ.Сценарий КАК Сценарий,
	//		|	ВТ_ВИДРАБОТ.Проект КАК Проект,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.Проект) = ТИП(СТРОКА) КАК ПроектЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.Месторождение КАК Месторождение,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.Месторождение) = ТИП(СТРОКА) КАК МесторождениеЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.Куст КАК Куст,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.Куст) = ТИП(СТРОКА) КАК КустЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.Скважина КАК Скважина,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.Скважина) = ТИП(СТРОКА) КАК СкважинаЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.Этап КАК Этап,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.Этап) = ТИП(СТРОКА) КАК ЭтапЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.ВидРабот КАК ВидРабот,
	//		|	ТИПЗНАЧЕНИЯ(ВТ_ВИДРАБОТ.ВидРабот) = ТИП(СТРОКА) КАК ВидРаботЭтоСтрока,
	//		|	ВТ_ВИДРАБОТ.ИмяФайла КАК ИмяФайла
	//		|ИЗ
	//		|	ВТ_ВИДРАБОТ КАК ВТ_ВИДРАБОТ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|УНИЧТОЖИТЬ ВТ_ВИДРАБОТ";
	//
	//Запрос.УстановитьПараметр("ВТ_ERP", ТаблицаРезультат); 
	//Запрос.УстановитьПараметр("ПапкаПРОЕКТЫ", ОсновнаяПапкаПроектов);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//
	//	Нстр = Объект.Этапы.Добавить();
	//	Нстр.ПроектРедактируется = Выборка.ПроектЭтоСтрока;
	//	Нстр.МесторождениеРедактируется = Выборка.МесторождениеЭтоСтрока;
	//	Нстр.КустРедактируется = Выборка.КустЭтоСтрока;
	//	Нстр.СкважинаРедактируется = Выборка.СкважинаЭтоСтрока;
	//	Нстр.ЭтапРедактируется = Выборка.ЭтапЭтоСтрока;
	//	Нстр.ВидРаботРедактируется = Выборка.ВидРаботЭтоСтрока;
	//	Нстр.Выбор = Истина;
	//	
	//	ЗаполнитьЗначенияСвойств(Нстр, Выборка);
	//	
	//	Если Не ТипЗнч(Нстр.Этап) = Тип("Строка") Тогда
	//		МассивГУИДЭтапов.Добавить(Выборка.ИмяФайла);	
	//		Объект.Этапы.Удалить(НСтр);
	//	КонецЕсли;
	//
	//КонецЦикла; 
	
	Объект.Этапы.Сортировать("Проект ВОЗР, Месторождение ВОЗР, Куст ВОЗР, Скважина ВОЗР, Этап ВОЗР, ВидРабот ВОЗР");
	
	// отметить созданные этапы в базе ЕРП
	Если МассивГУИДЭтапов.Количество() > 0 Тогда
		ОтметитьЭтапыВЕРП(МассивГУИДЭтапов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭтапыНаСервере() 
	
	МассивСтрокДляУдаления = Новый Массив;
	МассивГУИДЭтапов       = Новый Массив;
	
	ДействиеПредыдущее = Неопределено;
	
	Для каждого Строка Из Объект.Этапы Цикл
	
		Если Не Строка.Выбор Тогда
			Продолжить;
		КонецЕсли;
		
		ОпределитьПроект(Строка);
		ОпределитьМесторождение(Строка);
		ОпределитьКуст(Строка);
		ОпределитьСкважина(Строка);
		ОпределитьЭтап(Строка);
		ОпределитьВидРабот(Строка);	
		
		СоздатьВидРабот(Строка);
		
		СоздатьПроект(Строка);
		СоздатьМесторождение(Строка);
		СоздатьКуст(Строка);
		СоздатьСкважина(Строка);
		СоздатьЭтап(Строка);
		
		МассивГУИДЭтапов.Добавить(Строка.ИмяФайла);
		МассивСтрокДляУдаления.Добавить(Строка);	
		
	КонецЦикла;
	
	Для каждого Строка Из МассивСтрокДляУдаления Цикл
		Объект.Этапы.Удалить(Строка);		
	КонецЦикла;
	
	// отметить созданные этапы в базе ЕРП
	ОтметитьЭтапыВЕРП(МассивГУИДЭтапов);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭтапы(Команда)
	
	ПроверитьЭтапы();
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ПроверитьЭтапы()
	
	ПроцедураПродолжается = Истина;
	
	МассивРеквизитовПроверки = Новый Массив;
	МассивРеквизитовПроверки.Добавить("Проект");
	МассивРеквизитовПроверки.Добавить("Месторождение");
	МассивРеквизитовПроверки.Добавить("Куст");
	МассивРеквизитовПроверки.Добавить("Скважина");
	МассивРеквизитовПроверки.Добавить("Этап");
	МассивРеквизитовПроверки.Добавить("ВидРабот");
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить(ДействияЗагрузкаЭтапов.Прервать,          "Прервать"); 
	СписокДействий.Добавить(ДействияЗагрузкаЭтапов.Пропустить,        "Пропустить");
	СписокДействий.Добавить(ДействияЗагрузкаЭтапов.Продолжить,        "Да");
	СписокДействий.Добавить(ДействияЗагрузкаЭтапов.ПродолжитьДляВсех, "Да, для всех случаев");
	
	Для Каждого Строка Из Объект.Этапы Цикл
		
		Если НЕ Строка.Выбор Тогда
			Продолжить;
		КонецЕсли;
		
		Отказ = Ложь;
		ПричинаОтказа = "";
		Для каждого РеквизитПроверки Из МассивРеквизитовПроверки Цикл
			Если Не ЗначениеЗаполнено(Строка[РеквизитПроверки]) Тогда
				Отказ = Истина;
				ПричинаОтказа = СтрШаблон("В строке №%1 обнаружено пустое поле колонки ""%2"". Продолжить?", Строка.НомерСтроки, РеквизитПроверки);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	 
		
		Если Отказ Тогда
			Обещание = ВопросАсинх(ПричинаОтказа, СписокДействий);
			
			Результат = Ждать Обещание;
			
			// "Прервать" / Прервать
			Если Результат = СписокДействий[0].Значение Тогда 
				
		   		// Прерываем цикл и отменяем процедуру создания этапов 
				ПроцедураПродолжается = Ложь;
				Прервать;
				
			// "Пропустить" / Пропустить
			ИначеЕсли Результат = СписокДействий[1].Значение  Тогда
				
				// Убираем галочку "Выбор"
				Строка.Выбор = Ложь;
				
			// "Да" / Продолжить
			ИначеЕсли Результат = СписокДействий[2].Значение  Тогда
				
				// Цикл продолжается как обычно
				
			// "Да, для всех случаев" / ПродолжитьДляВсех
			ИначеЕсли Результат = СписокДействий[3].Значение  Тогда
				
				// Выходим из цикла, переход к процедуре создания этапов
				ПроцедураПродолжается = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПроцедураПродолжается Тогда
		СоздатьЭтапыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	БлокироватьРеквизитыЭтапыПТО(Истина);
	
	ПериодЗафиксированный = Объект.Период;
	
	Объект.ЭтапыПТО.Очистить();
	
	ПутьКWebСервисуERPБюджетирование = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПредопределенноеЗначение("ПланВидовХарактеристик.игсНастройкиМеханизмов.ПутьКWebСервисуERPБюджетирование"), ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));	
	
	Определения 		= Новый WSОпределения(ПутьКWebСервисуERPБюджетирование, "wsFiles", "wsP@ssw0rd1809");
	
	Прокси 		 		= Новый WSПрокси(Определения, "http://127.0.0.1", "IGS", "IGSSoap");       
	Прокси.Пользователь = "wsFiles";
	Прокси.Пароль 		= "wsP@ssw0rd1809";
	
	ОрганизацияИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ИНН");
	
	ТабРезультатСтрокой = Прокси.ВыгрузитьСправкуПТО(НачалоМесяца(ПериодЗафиксированный), КонецМесяца(ПериодЗафиксированный), СокрЛП(Объект.Организация.ИНН));
	ТабРезультат = ЗначениеИзСтрокиВнутр(ТабРезультатСтрокой);

	Если ТабРезультат.Количество()>0 Тогда
		Объект.Комментарий = ТабРезультат[0].Комментарий;
	КонецЕсли;
	
	СоответсвиеБригад = ПолучитьСоответсвиеБригад();
	
	НеВыгруженоВУСО = 0;
	
	МассивГУИДЭтапов = Новый Массив;
	
	Для каждого текСтрока Из ТабРезультат Цикл
		
		Нстр = Объект.ЭтапыПТО.Добавить();
		
		НГСтрокой = текСтрока.Скважина;
		НГ = НайтиНГ(НГСтрокой);
		
		Если Не ЗначениеЗаполнено(НГ) 
			И Найти(НГСтрокой, "# куст Без куста #") <> 0 Тогда
			НГ = НайтиНГ(СтрЗаменить(НГСтрокой, "# куст Без куста #", "# Без куста #"));
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(НГ) 
			И Найти(НГСтрокой, "# куст Без куста #") <> 0 Тогда
			НГ = НайтиНГ(СтрЗаменить(НГСтрокой, "# куст Без куста #", "куст Без куста # куст Без куста #"));
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(НГ) Тогда
			Нстр.НоменклатурнаяГруппа = НГ;	
		Иначе	
			Нстр.НоменклатурнаяГруппа = НГСтрокой;
			Нстр.НоменклатурнаяГруппаЭтоСтрока = Истина;
		КонецЕсли;

		ДатаНачала = Дата(текСтрока.ДатаНачала);
		Если ДатаНачала = Дата(1, 1, 1) Тогда
			Нстр.ДатаНачала = НачалоМесяца(ПериодЗафиксированный);	
		Иначе
			Нстр.ДатаНачала = ДатаНачала;	
		КонецЕсли;

		ДатаОкончания = Дата(текСтрока.ДатаОкончания);
		Если ДатаОкончания = Дата(1, 1, 1) Тогда
			Нстр.ДатаОкончания = КонецМесяца(ПериодЗафиксированный);	
		Иначе
			Нстр.ДатаОкончания = ДатаОкончания;	
		КонецЕсли; 
		
		Нстр.КоличествоСуток = Число(текСтрока.КоличествоСуток);
		Нстр.НачалоИнтервала = Число(текСтрока.НачалоИнтервала);
		Нстр.ОкончаниеИнтервала = Число(текСтрока.ОкончаниеИнтервала);
		Нстр.Проходка = Число(текСтрока.Проходка);
		
		БуроваяУстановкаСтрокой = текСтрока.БуроваяУстановка;
		Если БуроваяУстановкаСтрокой = "" Тогда
			Нстр.БуроваяУстановка = Справочники.игсБуровыеУстановки.ПустаяСсылка();
		Иначе
			БуроваяУстановка = НайтиБуровую(БуроваяУстановкаСтрокой);
			Если ЗначениеЗаполнено(БуроваяУстановка) Тогда
				Нстр.БуроваяУстановка = БуроваяУстановка;	
			Иначе
				Нстр.БуроваяУстановка = БуроваяУстановкаСтрокой;
				Нстр.БуроваяУстановкаЭтоСтрока = Истина
			КонецЕсли;
		КонецЕсли;
		
		БригадаСтрокой = текСтрока.БуроваяБригада;
		Если БригадаСтрокой <> "" Тогда
				Бригада = НайтиБригаду(БригадаСтрокой, СоответсвиеБригад);
				Если ЗначениеЗаполнено(Бригада) Тогда
					Нстр.Бригада = НайтиБригаду(БригадаСтрокой, СоответсвиеБригад);
				Иначе
					Нстр.Бригада = БригадаСтрокой;
					Нстр.БригадаЭтоСтрока = Истина;
				КонецЕсли;
		КонецЕсли;
		
		Нстр.ГуидЭтапа = текСтрока.ГуидЭтапа;
		Нстр.СогласованоДляВыгрузкиВУСО = текСтрока.СогласованоДляВыгрузкиВУСО;
		Нстр.ВыгружатьВУСО = текСтрока.ВыгружатьВУСО;
		
		// если этап уже загружен, и нет отметки "СогласованоДляВыгрузкиВУСО" то надо ее ставить...
		Если Не ТипЗнч(Нстр.НоменклатурнаяГруппа) = Тип("Строка") Тогда
			МассивГУИДЭтапов.Добавить(текСтрока.ГУИДЭтапа);	
			Нстр.СогласованоДляВыгрузкиВУСО = Истина;
		КонецЕсли;
		
		Если (Нстр.ВыгружатьВУСО=Ложь и Нстр.СогласованоДляВыгрузкиВУСО=Ложь) или (Нстр.ВыгружатьВУСО=Истина и Нстр.СогласованоДляВыгрузкиВУСО=Ложь) Тогда
			НеВыгруженоВУСО = НеВыгруженоВУСО+1;
		КонецЕсли;
		
	КонецЦикла; 
	
	// отметить созданные этапы в базе ЕРП
	Если МассивГУИДЭтапов.Количество()>0 Тогда
		ОтметитьЭтапыВЕРП(МассивГУИДЭтапов);
	КонецЕсли;
	
	// если есть этапы не отмеченные для выгрузки в УСО
	Если НеВыгруженоВУСО>0 Тогда
		
		МассивЭтапов = Новый Массив;
		Для каждого текСтрока Из Объект.ЭтапыПТО Цикл
			Если текСтрока.ВыгружатьВУСО = Ложь Тогда
				МассивЭтапов.Добавить(текСтрока.ГУИДЭтапа);
			КонецЕсли;
		КонецЦикла;
		
		Прокси.ОтметитьЭтапыДляВыгрузкиУСО(ЗначениеВСтрокуВнутр(МассивЭтапов));
		ПрочитатьДанныеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры  

Функция НайтиБригаду(БригадаСтрокой, Соот)
	
	Если Соот.НайтиСтроки(Новый Структура("Строка", СтрЗаменить(БригадаСтрокой, " ", ""))).Количество() <> 1 Тогда
		Возврат БригадаСтрокой;
	Иначе
		Возврат Соот.Найти(СтрЗаменить(БригадаСтрокой, " ", ""), "Строка").Ссылка;	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоответсвиеБригад()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Наименование ПОДОБНО &Наименование
	|	И НЕ ПодразделенияОрганизаций.ПометкаУдаления
	|	И ПодразделенияОрганизаций.Владелец = &Организация";
	
	Запрос.УстановитьПараметр("Наименование", "%Буровая бригада%");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Соот = Новый ТаблицаЗначений;
	Соот.Колонки.Добавить("Строка");
	Соот.Колонки.Добавить("Ссылка");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Нстр = Соот.Добавить();
		Нстр.Строка = СтрЗаменить(ВыборкаДетальныеЗаписи.Ссылка.Наименование, " ", "");
		Нстр.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЦикла; 
	
	Возврат Соот;
		
КонецФункции // ПолучитьСоответсвиеБригад() 

Функция НайтиНГ(НГСтрокой)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НГСтрокой);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 1 Тогда
		Возврат Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

КонецФункции // НайтиНГ() 

Функция НайтиБуровую(БуроваяУстановкаСтрокой)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игсБуровыеУстановки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.игсБуровыеУстановки КАК игсБуровыеУстановки
	|ГДЕ
	|	игсБуровыеУстановки.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", БуроваяУстановкаСтрокой);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 1 Тогда
		Возврат Справочники.игсБуровыеУстановки.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;

КонецФункции // НайтиБуровую()

&НаКлиенте
Процедура Прочитать(Команда)	
	
	ОрганизацияНеЗаполнена = НЕ ЗначениеЗаполнено(Объект.Организация);
	ПериодНеЗаполнен = НЕ ЗначениеЗаполнено(Объект.Период);
	
	Если ОрганизацияНеЗаполнена Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"""Организация"" обязательна к заполнению для получения данных!"
		, , "Организация", "Объект");
		
	КонецЕсли;
	
	Если ПериодНеЗаполнен Тогда 
				
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"""Отчетный месяц"" обязателен к заполнению для получения данных!"
		, , "Период", "Объект");
		
	КонецЕсли;
	
	Если ОрганизацияНеЗаполнена ИЛИ ПериодНеЗаполнен Тогда
		Возврат;	
	КонецЕсли;
	
	ПрочитатьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Отказ = Ложь;
	
	// Заполненность ТЧ
	Если Объект.ЭтапыПТО.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Табличная часть не может быть пустой!"
			, , "ЭтапыПТО", "Объект", Отказ);
		
	КонецЕсли;
	
	Для Каждого Строка Из Объект.ЭтапыПТО Цикл
		
		Если Строка.НоменклатурнаяГруппаЭтоСтрока 
			ИЛИ Строка.БуроваяУстановкаЭтоСтрока Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Обратите внимание, что для создания Справки ПТО необходимо устранить незаполненные элементы!
			|Они выделены красным в Таблице ""Справка ПТО (Этапы)""."
			, , "ЭтапыПТО", "Объект", Отказ);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСправкаПТО = СоздатьСправкуПТО();
	
	Если ЗначениеЗаполнено(НоваяСправкаПТО) Тогда
		
		ФормаДокумента = ПолучитьФорму("Документ.игсСправкаПТО.Форма.ФормаДокумента",
		Новый Структура("Ключ", НоваяСправкаПТО));
		ФормаДокумента.Открыть();
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция СоздатьСправкуПТО()
	
	Попытка 
		
		НоваяСправкаПТО = Документы.игсСправкаПТО.СоздатьДокумент();
		НоваяСправкаПТО.Дата = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(НоваяСправкаПТО, Объект, , "Этапы");
		
		Для каждого Строка Из Объект.ЭтапыПТО Цикл
			
			Нстр = НоваяСправкаПТО.Этапы.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр, Строка);
			
		КонецЦикла;	 
		
		НоваяСправкаПТО.Записать(РежимЗаписиДокумента.Запись);
		
		Возврат НоваяСправкаПТО.Ссылка;
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю(
		"Возникла проблема при создании ""Справка ПТО"", обратитесь к администратору. Описание ошибки:" + ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат ПредопределенноеЗначение("Документ.игсСправкаПТО.ПустаяСсылка");
		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ОсновнаяПапкаПроектовНастройка = ПредопределенноеЗначение("ПланВидовХарактеристик.игсНастройкиМеханизмов.ОсновнаяПапкаПроектов");
	//ОсновнаяПапкаПроектов	= игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ОсновнаяПапкаПроектовНастройка, ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатурныеГруппы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
		|ГДЕ
		|	НоменклатурныеГруппы.Наименование = ""ПРОЕКТЫ""
		|	И НоменклатурныеГруппы.Родитель = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОсновнаяПапкаПроектов = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если НЕ УказанаНастройкиМех(ОсновнаяПапкаПроектов) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	
	Объект.Организация = ОбщегоНазначения.ОбщийМодуль("Справочники.Организации").ОрганизацияПоУмолчанию();
	
	УстановитьОграниченияДляТЧ_Этапы();
	
	БлокироватьРеквизитыЭтапыПТО(Ложь);
	
	ПрочитатьДанныеНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	
КонецПроцедуры  

&НаСервере
Процедура ОпределитьПроект(Строка)
	
	Строка.ПроектЭтоСтрока = Истина;
		
	Если ТипЗнч(Строка.Проект) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	
	Родитель 	= ОсновнаяПапкаПроектов;
	Ищем 		= Строка.Проект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Родитель = &Родитель
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.ПроектЭтоСтрока = Ложь;
		Строка.Проект = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьМесторождение(Строка)
	
	Строка.МесторождениеЭтоСтрока = Истина;
	
	Если ТипЗнч(Строка.Месторождение) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Проект) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель 	= Строка.Проект;
	Ищем 		= Строка.Месторождение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Родитель = &Родитель
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.МесторождениеЭтоСтрока = Ложь;
		Строка.Месторождение = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;

КонецПроцедуры

Процедура ОпределитьКуст(Строка)
	
	Строка.КустЭтоСтрока = Истина;
	
	Если ТипЗнч(Строка.Куст) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Месторождение) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель 	= Строка.Месторождение;
	Ищем 		= Строка.Куст;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Родитель = &Родитель
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.КустЭтоСтрока = Ложь;
		Строка.Куст = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;

КонецПроцедуры

Процедура ОпределитьСкважина(Строка)
	
	Строка.СкважинаЭтоСтрока = Истина;
	
	Если ТипЗнч(Строка.Скважина) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Куст) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель 	= Строка.Куст;
	Ищем 		= Строка.Скважина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Родитель = &Родитель
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.СкважинаЭтоСтрока = Ложь;
		Строка.Скважина = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;

КонецПроцедуры

Процедура ОпределитьЭтап(Строка)
	
	Строка.ЭтапЭтоСтрока = Истина;
	
	Если ТипЗнч(Строка.Этап) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Скважина) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель 	= Строка.Скважина;
	Ищем 		= Строка.Этап;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатурныеГруппы.Ссылка
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ПометкаУдаления
	|	И НоменклатурныеГруппы.Родитель = &Родитель
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.ЭтапЭтоСтрока = Ложь;
		Строка.Этап = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;

КонецПроцедуры

Процедура ОпределитьВидРабот(Строка)
	
	Строка.ВидРаботЭтоСтрока = Истина;
	
	Если ТипЗнч(Строка.ВидРабот) = Тип("СправочникСсылка.игсВидыРабот") Тогда
		Возврат;
	КонецЕсли;
	
	Ищем = Строка.ВидРабот;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игсВидыРабот.Ссылка
	|ИЗ
	|	Справочник.игсВидыРабот КАК игсВидыРабот
	|ГДЕ
	|	НЕ игсВидыРабот.ПометкаУдаления
	|	И игсВидыРабот.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Ищем);
	
	Результат 				= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка.ВидРаботЭтоСтрока = Ложь;
		Строка.ВидРабот = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;

КонецПроцедуры 

Процедура ОтметитьЭтапыВЕРП(МассивГУИДЭтапов)
	
	ПутьКWebСервисуERPБюджетирование = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПредопределенноеЗначение("ПланВидовХарактеристик.игсНастройкиМеханизмов.ПутьКWebСервисуERPБюджетирование"), ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	
	Определения 		= Новый WSОпределения(ПутьКWebСервисуERPБюджетирование, "wsFiles", "wsP@ssw0rd1809");
	
	Прокси 		 		= Новый WSПрокси(Определения, "http://127.0.0.1", "IGS", "IGSSoap");       
	Прокси.Пользователь = "wsFiles";
	Прокси.Пароль 		= "wsP@ssw0rd1809";
	
    ТабРезультатСтрокой = Прокси.ОтметитьЭтапы(ЗначениеВСтрокуВнутр(МассивГУИДЭтапов));
		
КонецПроцедуры    

&НаКлиенте
Процедура ЭтапыПроектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.ПроектЭтоСтрока = ТипЗнч(ТекущиеДанные.Проект) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМесторождениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.МесторождениеЭтоСтрока = ТипЗнч(ТекущиеДанные.Месторождение) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыКустПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.КустЭтоСтрока = ТипЗнч(ТекущиеДанные.Куст) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыСкважинаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.СкважинаЭтоСтрока = ТипЗнч(ТекущиеДанные.Скважина) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыЭтапПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.ЭтапЭтоСтрока = ТипЗнч(ТекущиеДанные.Этап) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыВидРаботПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	ТекущиеДанные.ВидРаботЭтоСтрока = ТипЗнч(ТекущиеДанные.ВидРабот) = Тип("Строка");
	
КонецПроцедуры 
 
Процедура СоздатьПроект(Строка)

	Если ТипЗнч(Строка.Проект) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
		
	Проект = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
	Проект.Наименование = Строка.Проект;
	Проект.Родитель = ОсновнаяПапкаПроектов;
	Проект.Записать();
	
	Строка.Проект = Проект.Ссылка;
	
КонецПроцедуры

Процедура СоздатьМесторождение(Строка)
	
	Если ТипЗнч(Строка.Месторождение) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Проект) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель = Строка.Проект;
	
	Месторождение = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
	Месторождение.Наименование = Строка.Месторождение;
	Месторождение.Родитель = Родитель;
	Месторождение.Записать();
	
	Строка.Месторождение = Месторождение.Ссылка;

КонецПроцедуры

Процедура СоздатьКуст(Строка)
	
	Если ТипЗнч(Строка.Куст) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Месторождение) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель = Строка.Месторождение;
	
	Куст = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
	Куст.Наименование = Строка.Куст;
	Куст.Родитель = Родитель;
	Куст.Записать();
	
	Строка.Куст = Куст.Ссылка;

КонецПроцедуры

Процедура СоздатьСкважина(Строка)
	
	Если ТипЗнч(Строка.Скважина) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Куст) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель = Строка.Куст;
	
	Скважина = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
	Скважина.Наименование = Строка.Скважина;
	Скважина.Родитель = Родитель;
	Скважина.Записать();
	
	Строка.Скважина = Скважина.Ссылка;

КонецПроцедуры

Процедура СоздатьЭтап(Строка)
	
	Если ТипЗнч(Строка.Этап) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(Строка.Скважина) <> Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат;
	КонецЕсли; 
	
	Родитель = Строка.Скважина;
	
	Этап = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
	Этап.Наименование = Строка.Этап;
	Этап.Родитель = Родитель;
	Этап.игсВидРабот = Строка.ВидРабот;
	Этап.Записать();
	
	Строка.Этап = Этап.Ссылка;

КонецПроцедуры

Процедура СоздатьВидРабот(Строка)

	Если ТипЗнч(Строка.ВидРабот) = Тип("СправочникСсылка.игсВидыРабот") Тогда
		Возврат;
	КонецЕсли;
	
	ВидРабот = Справочники.игсВидыРабот.СоздатьЭлемент();
	ВидРабот.Наименование = Строка.ВидРабот;
	ВидРабот.Записать();
	
	Строка.ВидРабот = ВидРабот.Ссылка;	

КонецПроцедуры  

Функция ИнициализацияДействийЗагрузкаЭтапов()

	РезультатВозрата =  Новый Структура;
	РезультатВозрата.Вставить("Прервать", "Прервать");
	РезультатВозрата.Вставить("Пропустить", "Пропустить");
	РезультатВозрата.Вставить("Продолжить", "Продолжить");
	РезультатВозрата.Вставить("ПродолжитьДляВсех", "ПродолжитьДляВсех");
	
	Возврат РезультатВозрата;
	
КонецФункции

&НаКлиенте
Процедура ЭтапыПТОНоменклатурнаяГруппаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	ТекущиеДанные.НоменклатурнаяГруппаЭтоСтрока = ТипЗнч(ТекущиеДанные.НоменклатурнаяГруппа) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОБригадаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	ТекущиеДанные.БригадаЭтоСтрока = ТипЗнч(ТекущиеДанные.Бригада) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОБуроваяУстановкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	ТекущиеДанные.БуроваяУстановкаЭтоСтрока = ТипЗнч(ТекущиеДанные.БуроваяУстановка) = Тип("Строка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОДатаНачалаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Тогда
		ТекущиеДанные.ДатаНачала = НачалоМесяца(Объект.Период);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОДатаОкончанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		ТекущиеДанные.ДатаОкончания = КонецМесяца(Объект.Период);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;

	// Проверки
	Если ТекущиеДанные.ДатаНачала > КонецМесяца(Объект.Период) 
		ИЛИ ТекущиеДанные.ДатаНачала < НачалоМесяца(Объект.Период) Тогда
		ТекущиеДанные.ДатаНачала = НачалоМесяца(Объект.Период);
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Указанная Дата Начала вышла за рамки периода! Значение было изменено автоматически."
		, , "ЭтапыПТО[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ДатаНачала", "Объект");
 	КонецЕсли;
 
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания)
	   И ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания Тогда
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала;
 	КонецЕсли;
	
	ПересчитатьКоличествоСуток(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;

	// Проверки
	Если ТекущиеДанные.ДатаОкончания > КонецМесяца(Объект.Период) 
		ИЛИ ТекущиеДанные.ДатаОкончания < НачалоМесяца(Объект.Период) Тогда
		ТекущиеДанные.ДатаОкончания = КонецМесяца(Объект.Период);
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Указанная Дата Окончания вышла за рамки периода! Значение было изменено автоматически."
		, , "ЭтапыПТО[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ДатаОкончания", "Объект");

 	КонецЕсли;
 
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
	   И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания)
	   И ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания Тогда
		ТекущиеДанные.ДатаНачала = ТекущиеДанные.ДатаОкончания;
 	КонецЕсли;
 
	ПересчитатьКоличествоСуток(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьКоличествоСуток(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	// Расчет
	ДатаНачала    = ?(ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала),    ТекущиеДанные.ДатаНачала,	   НачалоМесяца(Объект.Период));
	ДатаОкончания = ?(ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания), ТекущиеДанные.ДатаОкончания, КонецМесяца(Объект.Период) + 1);
	
	ТекущиеДанные.КоличествоСуток = (ДатаОкончания - ДатаНачала) / 86400;

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТОНачалоИнтервалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоИнтервала <= ТекущиеДанные.ОкончаниеИнтервала Тогда
		ТекущиеДанные.Проходка = ТекущиеДанные.ОкончаниеИнтервала - ТекущиеДанные.НачалоИнтервала;
 	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПТООкончаниеИнтервалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыПТО.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоИнтервала <= ТекущиеДанные.ОкончаниеИнтервала Тогда
		ТекущиеДанные.Проходка = ТекущиеДанные.ОкончаниеИнтервала - ТекущиеДанные.НачалоИнтервала;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьЗаново(Команда)
	
	Обещание = ВопросАсинх("Это действие очистит таблицу Справка ПТО (Этапы) и очистит Комментарий! " +
		"Вы уверены?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Результат = Ждать Обещание;
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		Объект.ЭтапыПТО.Очистить();
		БлокироватьРеквизитыЭтапыПТО(Ложь);

	КонецЕсли;
	
КонецПроцедуры 

&НаСервере 
// Определяет доступность видимость для некоторых элементов
//
// Параметры:
//  Режим - Булево - При "Ложь" будут доступны реквизиты Организация и Период, будет видна кнопка Прочитать.
//  При "Истина" перечисленные реквизиты будут недоступны, а вместо кнопки Прочитать будет видна Заполнить заново.
Процедура БлокироватьРеквизитыЭтапыПТО(Режим)
	
	Объект.Комментарий = ?(Режим, Объект.Комментарий, "");
	
	// Доступность
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организация",	"Доступность", НЕ Режим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Период",		"Доступность", НЕ Режим); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЭтапыПТО",		"Доступность", Режим);
	
	// Видимость
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Прочитать",			"Видимость", НЕ Режим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьЗаново",	"Видимость", Режим);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УказанаНастройкиМех(ОсновнаяПапкаПроектов)

	Если НЕ ЗначениеЗаполнено(ОсновнаяПапкаПроектов) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
		"Не указана ""Основная Папка Проектов"" в ""Настройки Механизмов""!
		|Пожалуйста, заполните настройку и попробуйте снова.");

		Возврат Ложь;
			
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьОграниченияДляТЧ_Этапы()
	
	// НоменклатурныеГруппы
	МассивТиповНГ = Новый Массив();
	МассивТиповНГ.Добавить(Тип("СправочникСсылка.НоменклатурныеГруппы"));
	ОписаниеТиповНГ = Новый ОписаниеТипов(МассивТиповНГ); 
	
	// ВидыРабот
	МассивТиповВР = Новый Массив();
	МассивТиповВР.Добавить(Тип("СправочникСсылка.игсВидыРабот"));
	ОписаниеТиповВР = Новый ОписаниеТипов(МассивТиповВР);
	
	// ПодразделенияОрганизации
	МассивТиповПодр = Новый Массив();
	МассивТиповПодр.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	ОписаниеТиповПодр = Новый ОписаниеТипов(МассивТиповПодр);
	
	// Проект
	Элементы.ЭтапыПроект.ОграничениеТипа = ОписаниеТиповНГ; 
	Элементы.ЭтапыПроект.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	
	// Месторождение
	Элементы.ЭтапыМесторождение.ОграничениеТипа = ОписаниеТиповНГ; 
	Элементы.ЭтапыМесторождение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	
	// Куст
	Элементы.ЭтапыКуст.ОграничениеТипа = ОписаниеТиповНГ; 
	Элементы.ЭтапыКуст.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	
	// Скважина
	Элементы.ЭтапыСкважина.ОграничениеТипа = ОписаниеТиповНГ; 
	Элементы.ЭтапыСкважина.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	
	// Этап
	Элементы.ЭтапыЭтап.ОграничениеТипа = ОписаниеТиповНГ; 
	Элементы.ЭтапыЭтап.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	
	// Вид работ
	Элементы.ЭтапыВидРабот.ОграничениеТипа = ОписаниеТиповВР; 
	Элементы.ЭтапыВидРабот.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	
	// Буровые бригады
	Элементы.ЭтапыПТОБригада.ОграничениеТипа = ОписаниеТиповПодр; 
	
КонецПроцедуры

ДействияЗагрузкаЭтапов = ИнициализацияДействийЗагрузкаЭтапов();
