
&НаСервере
Функция ПечатьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	
	ИспользоватьКонецДня = ?(ВремяИнвентаризации = 0, Ложь, Истина);
	
	Результат = ДокументОбъект.Печать(МассивОбъектовФормы.ВыгрузитьЗначения(), Новый ТаблицаЗначений, Новый СписокЗначений, Новый Структура, ИспользоватьКонецДня); 
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура Печать(Команда) 
	
	Результат = ПечатьнаСервере();
	Результат.Показать(); 
	Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивОбъектовФормы.ЗагрузитьЗначения(Параметры.ОбъектыНазначения); 
	
КонецПроцедуры

