
&НаСервере
Процедура ПечатьНаСервере() 
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ПЕЧАТЬКС2");
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.МассивЗначений(СсылкаНаДокумент);
	ОбъектыПечати = Новый СписокЗначений;
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
	
		ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры
