&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	
	Объект.СсылкаНаОбъект = ОбъектыНазначения[0];
	ПолучитьДанныеИсходногоДокумента();
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Заполнение возможно только при выбранной организации.'");
		Возврат;
	КонецЕсли;

	Если Объект.ТаблицаЗаполнена  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,0)
	Иначе
		Инициализировать();
	КонецЕсли;
    ВладелецФормы.Прочитать(); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИсходногоДокумента()  
	
	ИсходныйОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СсылкаНаОбъект,"игсСклад, Организация,ОС,ДокументОснованиеДата",Истина);
	Объект.Склад  = ИсходныйОбъект.игс_Склад;
	Объект.Период = ИсходныйОбъект.ДокументОснованиеДата;
	Объект.организация = ИсходныйОбъект.Организация;
	Если ИсходныйОбъект.Ос.Пустой() > 0 Тогда
		Объект.ТаблицаЗаполнена = Истина;
	Иначе
		Объект.ТаблицаЗаполнена = Ложь;
	КонецЕсли;           
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Инициализировать();
	КонецЕсли;
	ВладелецФормы.Прочитать(); 
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать() Экспорт 
	
	ЗапросОС = Новый Запрос;
	ЗапросОС.текст = 
	"ВЫБРАТЬ
	|	игсАрендованныеОСОстатки.ОсновноеСредство КАК ОС,
	|	игсАрендованныеОСОстатки.Склад КАК Склад,
	|	игсАрендованныеОСОстатки.Контрагент КАК Контрагент,
	|	игсАрендованныеОСОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.игсАрендованныеОС.Остатки(&Периодданных, ) КАК игсАрендованныеОСОстатки
	|ГДЕ
	|	(игсАрендованныеОСОстатки.Склад = &Склад
	|			ИЛИ &Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|	И (игсАрендованныеОСОстатки.Организация = &Организация
	|			ИЛИ &организация = ЗНАЧЕНИЕ(Справочник.организации.ПустаяСсылка))
	|	И игсАрендованныеОСОстатки.СуммаОстаток > 0" ;
	ЗапросОС.УстановитьПараметр("Склад",Объект.Склад);
	ЗапросОС.УстановитьПараметр("Организация",Объект.организация);
	ЗапросОС.УстановитьПараметр("Периодданных",Объект.Период);
    результатЗапроса = запросОС.Выполнить(); 
	
	Если результатЗапроса <> неопределено Тогда
		ЦелевойОбъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();
		ЦелевойОбъект.ОС.Очистить();
		ОСДляЗаполнения = результатЗапроса.Выгрузить();
		
		Если ОСДляЗаполнения.Количество() > 0 Тогда 
			для каждого ОС из ОСДляЗаполнения Цикл
				новаяСтрока = ЦелевойОбъект.ОС.Добавить();
            	новаяСтрока.ОсновноеСредство = Ос.Ос;
				новаяСтрока.КоличествоПоДаннымУчета = 1;
				новаяСтрока.КоличествоФактическое = 1;
				НоваяСтрока.НаличиеФактическое  = Истина;
				НоваяСтрока.НаличиеПоДаннымУчета = истина;
				новаяСтрока.СтоимостьПоДаннымУчета = ОС.СуммаОстаток;
			КонецЦикла;
		КонецЕсли;
		ЦелевойОбъект.Записать();
	КонецЕсли;	
	
КонецПроцедуры

