#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт 
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = "Данные для подключения к web сервисам";
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Информация = "Данная обработка предоставляет удобный интерфейс для редактирования данных подключений к web-сервисам других ИС.";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Изменить данные для подключения к web сервисам";
	НоваяКоманда.Идентификатор = "ДАННЫЕДЛЯПОДКЛЮЧЕНИЯКВС";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(); 
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции  

#КонецОбласти
