
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт   

	Версия = "1.0";
	КраткоеОписание = "Транспортные средства не указанные в справке ПТО";
	Информация     = "Предназначен для отслеживания корректности внесения информации по технике";
	Идентификатор = "ТранспортныеСредстваНеУказанныеВСправкеПТО";

    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Информация = НСтр("ru = '" + Информация + "'");
    ПараметрыРегистрации.Версия = Версия;

    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = КраткоеОписание;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;

    Возврат ПараметрыРегистрации;

КонецФункции  

#КонецОбласти