
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт   
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.3.0");
	ПараметрыРегистрации.Информация 		= НСтр("ru = 'Предназначен для отслеживания корректности внесения информации по технике.'");
	ПараметрыРегистрации.Наименование 		= НСтр("ru = 'Транспортные средства не указанные в справке ПТО'");	
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 			= "1.1";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	
	Команда 								= ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление 					= НСтр("ru = 'Транспортные средства не указанные в справке ПТО'");
	Команда.Идентификатор 					= "ТранспортныеСредстваНеУказанныеВСправкеПТО";
	Команда.Использование 					= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение 			= Ложь;
	Команда.Модификатор 					= "ПечатьMXL";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции  

#КонецОбласти