Функция СведенияОВнешнейОбработке() Экспорт 
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ИнвентаризацияОС");                                                                
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ЗаполнениеОбъекта");  
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Заполнение табличной части инвентаризации основных средств по 001 счету (ОС)"); 
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.10.403");
	ПараметрыРегистрации.Вставить("Информация", "Заполнение ОС"); 
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Заполнить ОС по 001 счету", "ЗаполнитьОС001", "ВызовКлиентскогоМетода");
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат  ПараметрыРегистрации; 
	
конецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка"); 
	Команды.Колонки.Добавить("Представление", ОписаниеТиповСтрока);
	Команды.Колонки.Добавить("Идентификатор", ОписаниеТиповСтрока);
	Команды.Колонки.Добавить("Использование", ОписаниеТиповСтрока); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", ОписаниеТиповСтрока);
	Команды.Колонки.Добавить("ПроверкаПроведенияПередПечатью", Новый ОписаниеТипов("Булево"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	НоваяКоманда.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры 





