 Функция СведенияОВнешнейОбработке() Экспорт
	 
	 ПараметрыРегистрации = Новый Структура; 
	 
	 ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет"); 
	 ПараметрыРегистрации.Вставить("Наименование", "Детализация распределения по справкам");
	 ПараметрыРегистрации.Вставить("Версия", "1.0");
	 ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	 ПараметрыРегистрации.Вставить("Информация", "Отчет детализация распределения по справкам");
	 
	 ТаблицаКоманд = ПолучитьТаблицуКоманд();
	 
	 ДобавитьКоманду(ТаблицаКоманд,
	 "Детализация Распределения По Справкам",
	 "СформироватьОтчет",
	 "ОткрытиеФормы",
	 Истина);
	 
	 ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	 Возврат ПараметрыРегистрации;
	 
	 
 КонецФункции  
 
 Функция ПолучитьТаблицуКоманд()
	 
	 Команды = Новый ТаблицаЗначений;
	 
	 Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	 Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	 Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	 Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	 Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	 
	 Возврат Команды;
	 
 КонецФункции
 
 Процедура ДобавитьКоманду(ТаблицаКоманд, Представление,Идентификатор, Использование, Показыватьоповещение = Ложь, Модификатор = "")
	 
	 НоваяКоманда = ТаблицаКоманд.Добавить();
	 НоваяКоманда.Представление = Представление;
	 НоваяКоманда.Идентификатор = Идентификатор;
	 НоваяКоманда.Использование = Использование;
	 НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	 НоваяКоманда.Модификатор = Модификатор;
	 
 КонецПроцедуры   
