 
 #Область ПрограммныйИнтерфейс
 
 Функция СведенияОВнешнейОбработке() Экспорт

    ИмяОтчета = ЭтотОбъект.Метаданные().Имя;
    Синоним = ЭтотОбъект.Метаданные().Синоним;
    Синоним = ?(ЗначениеЗаполнено(Синоним), Синоним, ИмяОтчета);

    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
    РегистрационныеДанные.Вставить("Наименование", Синоним);
    РегистрационныеДанные.Вставить("Версия", "1.0");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
    РегистрационныеДанные.Вставить("Информация", "Отчет ""Расчет выручки по договорам строительного подряда"".
	|
	|Автор: <ИГС> ПР Потылицын Г.С. #0012, 30.07.2025");

    ТаблицаКоманд = ПолучитьТаблицуКоманд();

    ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет", "ОткрытиеФормы", Истина);

    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);

    Возврат РегистрационныеДанные;

КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуКоманд()

    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

    Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")

    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор; 
	
КонецПроцедуры

// Возвращает Индекс параметра
// * КоллекцияЭлементов - область поиска параметров;
// * ИмяПараметра - имя по которому будет осуществляться поиск
Функция ПолучитьИндексПараметра(КоллекцияЭлементов, ИмяПараметра)
	
	Индекс = 0;
	
	Для Каждого Элемент Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если Строка(Элемент.Параметр) = ИмяПараметра Тогда
			Возврат Индекс;
		КонецЕсли;
		
	Индекс = Индекс + 1;
	КонецЦикла;

    Возврат -1;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Поиск Индексов параметров 
	СтандПериодИндекс = ПолучитьИндексПараметра(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы, "СтандПериод");
	КонецПредИндекс = ПолучитьИндексПараметра(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы, "КонПериодаПред");
	
	Если СтандПериодИндекс = -1 ИЛИ СтандПериодИндекс = -1 Тогда
		Возврат;	
	КонецЕсли;
	
	// Получение значений параметров
	ДатаНачала = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[СтандПериодИндекс].Значение.ДатаНачала;
	КонецПред = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[КонецПредИндекс].Значение;
	
	// Сокращение обращения к полям и установка актуального года
	Поля = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля;
	АктуальныйГод = Год(ДатаНачала);
	
	// Заполнение заголовков полей "Год1", "Год2", "Год3" и "Год4" актуальными данными
	Индекс = 4;
	Пока Индекс > 0 Цикл 
		
		ТекущийГод = АктуальныйГод - (4 - Индекс);
		ТекущийГодСтрока = СтрЗаменить(Строка(ТекущийГод), Символы.НПП, "");
		
		Поля.Найти("Год" + Строка(Индекс)).Заголовок = ТекущийГодСтрока + " год";
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	// Заполнение параметра "КонПериодаПред", если пользователь не заполнил его
	Если НЕ ЗначениеЗаполнено(КонецПред) Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[КонецПредИндекс].Значение = НачалоМесяца(ДатаНачала) - 1;	
	КонецЕсли;
	
	// Заполнение месяца для предыдущего периода в формате "Месяц 0000 г."
	ПрошлыйМесяц = Формат(Дата(КонецПред), "ДФ='MMMM yyyy ''г.'''");
	Поля.Найти("ПлановаяСебестоимостьПред").Заголовок = "Плановая себестоимость " + Символы.ПС + "(" + ПрошлыйМесяц + ")";
	Поля.Найти("ПлановаяВыручкаПред").Заголовок = "Плановая выручка" + Символы.ПС + "(" + ПрошлыйМесяц + ")"; 
	
КонецПроцедуры           

#КонецОбласти



