
&НаСервере
Функция ПечатьНаСервере()  
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивПечати = Новый Массив;
	МассивПечати.Добавить(ДокументОбъект.СсылкаНаОбъект);
	
	Объект.использоватьАртикул = Элементы.использоватьАртикул;
	
	Результат = ДокументОбъект.Печать(МассивПечати, Новый ТаблицаЗначений, Новый СписокЗначений, Новый Структура);	
	
	Возврат Результат;
	
КонецФункции
 
&НаКлиенте
Процедура Печать(Команда)  
	
	Результат = ПечатьНаСервере();
	Результат.Показать();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Объект.СсылкаНаОбъект = Параметры.ОбъектыНазначения[0]; 
	
КонецПроцедуры