#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
	
	ERPМТОПуть = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуERP"], ПустаяОрганизация);
	ERPБюджетированиеПуть = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуERPБюджетирование"], ПустаяОрганизация);
	ЗУППуть = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуЗУП"], ПустаяОрганизация);
	ДОПуть = игсНастройкиМеханизмовВызовСервера.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуДО"], ПустаяОрганизация);
	
	ДанныеПодключения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.игсНастройкиМеханизмов"), Неопределено); 
	
	Если ЗначениеЗаполнено(ДанныеПодключения) И ТипЗнч(ДанныеПодключения) = Тип("Структура") Тогда 
		
		ERPМТОЛогин = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ЛогинМТО", "");
		ERPМТОПароль = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ПарольМТО", "");
		
		ERPБюджетированиеЛогин = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ЛогинERPБюджетирование", "");
		ERPБюджетированиеПароль = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ПарольERPБюджетирование", "");  
		
		ЗУПЛогин = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ЛогинЗУП", "");
		ЗУППароль = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ПарольЗУП", "");
		
		ДОЛогин = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ЛогинДО", "");
		ДОПароль = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПодключения, "ПарольДО", ""); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти      

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	ДанныеПодключения = Новый Структура;
	ДанныеПодключения.Вставить("ЛогинМТО", ERPМТОЛогин);
	ДанныеПодключения.Вставить("ПарольМТО", ERPМТОПароль);
	ДанныеПодключения.Вставить("ЛогинERPБюджетирование", ERPБюджетированиеЛогин);
	ДанныеПодключения.Вставить("ПарольERPБюджетирование", ERPБюджетированиеПароль);
	ДанныеПодключения.Вставить("ЛогинЗУП", ЗУПЛогин);
	ДанныеПодключения.Вставить("ПарольЗУП", ЗУППароль);
	ДанныеПодключения.Вставить("ЛогинДО", ДОЛогин);
	ДанныеПодключения.Вставить("ПарольДО", ДОПароль); 
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.игсНастройкиМеханизмов"), ДанныеПодключения, Неопределено);
	
	игсНастройкиМеханизмовВызовСервера.УстановитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуERP"], ERPМТОПуть, ПустаяОрганизация, ТекущаяДатаСеанса());
	игсНастройкиМеханизмовВызовСервера.УстановитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуERPБюджетирование"], ERPБюджетированиеПуть, ПустаяОрганизация, ТекущаяДатаСеанса());
	игсНастройкиМеханизмовВызовСервера.УстановитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуЗУП"], ЗУППуть, ПустаяОрганизация, ТекущаяДатаСеанса());
	игсНастройкиМеханизмовВызовСервера.УстановитьЗначениеНастройки(ПланыВидовХарактеристик.игсНастройкиМеханизмов["ПутьКWebСервисуДО"], ДОПуть, ПустаяОрганизация, ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти

